nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
//
// Copyright (c) 2017 The nanoFramework project contributors
// See LICENSE file in the project root for full license information.
//

//__________________________________________________________________________________ 
// Code extracted from online mbed compiler example "/DISCO-F769NI_TOUCHSCREEN_demo/
//__________________________________________________________________________________ 


#ifdef __cplusplus
extern "C" {
#endif

#include "STM32F7LcdSupport.h"

// __________________________________________________
// Supporting code for the STMf32769-Discovery board
// __________________________________________________

    DSI_HandleTypeDef hdsi_discovery;
    static DSI_VidCfgTypeDef hdsivideo_handle;
    __IO uint32_t uwTick;
    static ft6x06_handle_TypeDef ft6x06_handle = { FT6206_I2C_NOT_INITIALIZED, 0, 0 };
    static TS_DrvTypeDef* ts_driver;
    static uint8_t  ts_orientation;
    uint8_t  I2C_Address = 0;
    static I2C_HandleTypeDef hI2cAudioHandler = { 0 };
    uint8_t ft6x06[FT6x06_MAX_INSTANCE] = { 0 };
    LTDC_HandleTypeDef  hltdc_discovery;
    static LCD_DrawPropTypeDef DrawProp[LTDC_MAX_LAYER_NUMBER];
    static FMC_SDRAM_TimingTypeDef Timing;
    SDRAM_HandleTypeDef sdramHandle;
    static FMC_SDRAM_CommandTypeDef Command;

    void STM32F769i_Discovery_LCD_INIT(uint32_t FB_Address)
    {
        uint16_t LayerIndex = 0;

        BSP_LCD_InitEx(LCD_ORIENTATION_PORTRAIT);
        BSP_LCD_LayerDefaultInit(LayerIndex, FB_Address);
        BSP_TS_Init();
    }

    uint8_t OTM8009A_Init(uint32_t ColorCoding, uint32_t orientation)
    {
        
        UNUSED(ColorCoding);
        UNUSED(orientation);

        /* Enable CMD2 to access vendor specific commands                               */
        /* Enter in command 2 mode and set EXTC to enable address shift function (0x00) */
        //DSI_IO_WriteCmd(0, (uint8_t*)ShortRegData1);
        //DSI_IO_WriteCmd(3, (uint8_t*)lcdRegData1);

        ///* Enter ORISE Command 2 */
        //DSI_IO_WriteCmd(0, (uint8_t*)ShortRegData2); /* Shift address to 0x80 */
        //DSI_IO_WriteCmd(2, (uint8_t*)lcdRegData2);

        return 0;
    }
    
    void wait_ms(int delay)
    {
        UNUSED(delay);
    }


    void HAL_SDRAM_MspInit(SDRAM_HandleTypeDef* hsdram)
    {
        UNUSED(hsdram);
        GPIO_InitTypeDef gpio_init_structure;

        /* Enable FMC clock */
        __HAL_RCC_FMC_CLK_ENABLE();

        /* Enable GPIOs clock */
        __HAL_RCC_GPIOD_CLK_ENABLE();
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_GPIOF_CLK_ENABLE();
        __HAL_RCC_GPIOG_CLK_ENABLE();
        __HAL_RCC_GPIOH_CLK_ENABLE();
        __HAL_RCC_GPIOI_CLK_ENABLE();

        /* Common GPIO configuration */
        gpio_init_structure.Mode = GPIO_MODE_AF_PP;
        gpio_init_structure.Pull = GPIO_PULLUP;
        gpio_init_structure.Speed = GPIO_SPEED_FAST;
        gpio_init_structure.Alternate = GPIO_AF12_FMC;

        /* GPIOD configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | \
            GPIO_PIN_14 | GPIO_PIN_15;


        HAL_GPIO_Init(GPIOD, &gpio_init_structure);

        /* GPIOE configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | \
            GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | \
            GPIO_PIN_15;

        HAL_GPIO_Init(GPIOE, &gpio_init_structure);

        /* GPIOF configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | \
            GPIO_PIN_15;

        HAL_GPIO_Init(GPIOF, &gpio_init_structure);

        /* GPIOG configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_8 | GPIO_PIN_15;
        HAL_GPIO_Init(GPIOG, &gpio_init_structure);

        /* GPIOH configuration */
        gpio_init_structure.Pin = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_5 | GPIO_PIN_8 | GPIO_PIN_9 | \
            GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | \
            GPIO_PIN_15;
        HAL_GPIO_Init(GPIOH, &gpio_init_structure);

        /* GPIOI configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_9 | GPIO_PIN_10;
        HAL_GPIO_Init(GPIOI, &gpio_init_structure);
    }
    HAL_StatusTypeDef FMC_SDRAM_Timing_Init(FMC_SDRAM_TypeDef* Device, FMC_SDRAM_TimingTypeDef* Timing, uint32_t Bank)
    {
        uint32_t tmpr1 = 0;
        uint32_t tmpr2 = 0;

        /* Check the parameters */
        assert_param(IS_FMC_SDRAM_DEVICE(Device));
        assert_param(IS_FMC_LOADTOACTIVE_DELAY(Timing->LoadToActiveDelay));
        assert_param(IS_FMC_EXITSELFREFRESH_DELAY(Timing->ExitSelfRefreshDelay));
        assert_param(IS_FMC_SELFREFRESH_TIME(Timing->SelfRefreshTime));
        assert_param(IS_FMC_ROWCYCLE_DELAY(Timing->RowCycleDelay));
        assert_param(IS_FMC_WRITE_RECOVERY_TIME(Timing->WriteRecoveryTime));
        assert_param(IS_FMC_RP_DELAY(Timing->RPDelay));
        assert_param(IS_FMC_RCD_DELAY(Timing->RCDDelay));
        assert_param(IS_FMC_SDRAM_BANK(Bank));

        /* Set SDRAM device timing parameters */
        if (Bank != FMC_SDRAM_BANK2)
        {
            tmpr1 = Device->SDTR[FMC_SDRAM_BANK1];

            /* Clear TMRD, TXSR, TRAS, TRC, TWR, TRP and TRCD bits */
            tmpr1 &= ((uint32_t)~(FMC_SDTR1_TMRD | FMC_SDTR1_TXSR | FMC_SDTR1_TRAS | \
                FMC_SDTR1_TRC | FMC_SDTR1_TWR | FMC_SDTR1_TRP | \
                FMC_SDTR1_TRCD));

            tmpr1 |= (uint32_t)(((Timing->LoadToActiveDelay) - 1) | \
                (((Timing->ExitSelfRefreshDelay) - 1) << 4) | \
                (((Timing->SelfRefreshTime) - 1) << 8) | \
                (((Timing->RowCycleDelay) - 1) << 12) | \
                (((Timing->WriteRecoveryTime) - 1) << 16) | \
                (((Timing->RPDelay) - 1) << 20) | \
                (((Timing->RCDDelay) - 1) << 24));
            Device->SDTR[FMC_SDRAM_BANK1] = tmpr1;
        }
        else /* FMC_Bank2_SDRAM */
        {
            tmpr1 = Device->SDTR[FMC_SDRAM_BANK1];

