nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
            /* Clear TRC and TRP bits */
            tmpr1 &= ((uint32_t)~(FMC_SDTR1_TRC | FMC_SDTR1_TRP));

            tmpr1 |= (uint32_t)((((Timing->RowCycleDelay) - 1) << 12) | \
                (((Timing->RPDelay) - 1) << 20));

            tmpr2 = Device->SDTR[FMC_SDRAM_BANK2];

            /* Clear TMRD, TXSR, TRAS, TRC, TWR, TRP and TRCD bits */
            tmpr2 &= ((uint32_t)~(FMC_SDTR1_TMRD | FMC_SDTR1_TXSR | FMC_SDTR1_TRAS | \
                FMC_SDTR1_TRC | FMC_SDTR1_TWR | FMC_SDTR1_TRP | \
                FMC_SDTR1_TRCD));

            tmpr2 |= (uint32_t)(((Timing->LoadToActiveDelay) - 1) | \
                (((Timing->ExitSelfRefreshDelay) - 1) << 4) | \
                (((Timing->SelfRefreshTime) - 1) << 8) | \
                (((Timing->WriteRecoveryTime) - 1) << 16) | \
                (((Timing->RCDDelay) - 1) << 24));

            Device->SDTR[FMC_SDRAM_BANK1] = tmpr1;
            Device->SDTR[FMC_SDRAM_BANK2] = tmpr2;
        }

        return HAL_OK;
    }

    HAL_StatusTypeDef FMC_SDRAM_Init(FMC_SDRAM_TypeDef* Device, FMC_SDRAM_InitTypeDef* Init)
    {
        uint32_t tmpr1 = 0;
        uint32_t tmpr2 = 0;


        /* Check the parameters */
        assert_param(IS_FMC_SDRAM_DEVICE(Device));
        assert_param(IS_FMC_SDRAM_BANK(Init->SDBank));
        assert_param(IS_FMC_COLUMNBITS_NUMBER(Init->ColumnBitsNumber));
        assert_param(IS_FMC_ROWBITS_NUMBER(Init->RowBitsNumber));
        assert_param(IS_FMC_SDMEMORY_WIDTH(Init->MemoryDataWidth));
        assert_param(IS_FMC_INTERNALBANK_NUMBER(Init->InternalBankNumber));
        assert_param(IS_FMC_CAS_LATENCY(Init->CASLatency));
        assert_param(IS_FMC_WRITE_PROTECTION(Init->WriteProtection));
        assert_param(IS_FMC_SDCLOCK_PERIOD(Init->SDClockPeriod));
        assert_param(IS_FMC_READ_BURST(Init->ReadBurst));
        assert_param(IS_FMC_READPIPE_DELAY(Init->ReadPipeDelay));

        /* Set SDRAM bank configuration parameters */
        if (Init->SDBank != FMC_SDRAM_BANK2)
        {
            tmpr1 = Device->SDCR[FMC_SDRAM_BANK1];

            /* Clear NC, NR, MWID, NB, CAS, WP, SDCLK, RBURST, and RPIPE bits */
            tmpr1 &= ((uint32_t)~(FMC_SDCR1_NC | FMC_SDCR1_NR | FMC_SDCR1_MWID | \
                FMC_SDCR1_NB | FMC_SDCR1_CAS | FMC_SDCR1_WP | \
                FMC_SDCR1_SDCLK | FMC_SDCR1_RBURST | FMC_SDCR1_RPIPE));

            tmpr1 |= (uint32_t)(Init->ColumnBitsNumber | \
                Init->RowBitsNumber | \
                Init->MemoryDataWidth | \
                Init->InternalBankNumber | \
                Init->CASLatency | \
                Init->WriteProtection | \
                Init->SDClockPeriod | \
                Init->ReadBurst | \
                Init->ReadPipeDelay
                );
            Device->SDCR[FMC_SDRAM_BANK1] = tmpr1;
        }
        else /* FMC_Bank2_SDRAM */
        {
            tmpr1 = Device->SDCR[FMC_SDRAM_BANK1];

            /* Clear SDCLK, RBURST, and RPIPE bits */
            tmpr1 &= ((uint32_t)~(FMC_SDCR1_SDCLK | FMC_SDCR1_RBURST | FMC_SDCR1_RPIPE));

            tmpr1 |= (uint32_t)(Init->SDClockPeriod | \
                Init->ReadBurst | \
                Init->ReadPipeDelay);

            tmpr2 = Device->SDCR[FMC_SDRAM_BANK2];

            /* Clear NC, NR, MWID, NB, CAS, WP, SDCLK, RBURST, and RPIPE bits */
            tmpr2 &= ((uint32_t)~(FMC_SDCR1_NC | FMC_SDCR1_NR | FMC_SDCR1_MWID | \
                FMC_SDCR1_NB | FMC_SDCR1_CAS | FMC_SDCR1_WP | \
                FMC_SDCR1_SDCLK | FMC_SDCR1_RBURST | FMC_SDCR1_RPIPE));

            tmpr2 |= (uint32_t)(Init->ColumnBitsNumber | \
                Init->RowBitsNumber | \
                Init->MemoryDataWidth | \
                Init->InternalBankNumber | \
                Init->CASLatency | \
                Init->WriteProtection);

            Device->SDCR[FMC_SDRAM_BANK1] = tmpr1;
            Device->SDCR[FMC_SDRAM_BANK2] = tmpr2;
        }

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_SDRAM_Init(SDRAM_HandleTypeDef* hsdram, FMC_SDRAM_TimingTypeDef* Timing)
    {
        /* Check the SDRAM handle parameter */
        if (hsdram == NULL)
        {
            return HAL_ERROR;
        }

        if (hsdram->State == HAL_SDRAM_STATE_RESET)
        {
            /* Allocate lock resource and initialize it */
            hsdram->Lock = HAL_UNLOCKED;
//#if (USE_HAL_SDRAM_REGISTER_CALLBACKS == 1)
//            if (hsdram->MspInitCallback == NULL)
//            {
//                hsdram->MspInitCallback = HAL_SDRAM_MspInit;
//            }
//            hsdram->RefreshErrorCallback = HAL_SDRAM_RefreshErrorCallback;
//            hsdram->DmaXferCpltCallback = HAL_SDRAM_DMA_XferCpltCallback;
//            hsdram->DmaXferErrorCallback = HAL_SDRAM_DMA_XferErrorCallback;
//
//            /* Init the low level hardware */
//            hsdram->MspInitCallback(hsdram);
//#else
            /* Initialize the low level hardware (MSP) */
            HAL_SDRAM_MspInit(hsdram);
//#endif
        }

        /* Initialize the SDRAM controller state */
        hsdram->State = HAL_SDRAM_STATE_BUSY;

        /* Initialize SDRAM control Interface */
        FMC_SDRAM_Init(hsdram->Instance, &(hsdram->Init));

        /* Initialize SDRAM timing Interface */
        FMC_SDRAM_Timing_Init(hsdram->Instance, Timing, hsdram->Init.SDBank);

        /* Update the SDRAM controller state */
        hsdram->State = HAL_SDRAM_STATE_READY;

        return HAL_OK;
    }
    
    HAL_StatusTypeDef FMC_SDRAM_SendCommand(FMC_SDRAM_TypeDef* Device, FMC_SDRAM_CommandTypeDef* Command, uint32_t Timeout)
    {
        UNUSED(Timeout);
        __IO uint32_t tmpr = 0;
        /* Check the parameters */
        assert_param(IS_FMC_SDRAM_DEVICE(Device));
        assert_param(IS_FMC_COMMAND_MODE(Command->CommandMode));
        assert_param(IS_FMC_COMMAND_TARGET(Command->CommandTarget));
        assert_param(IS_FMC_AUTOREFRESH_NUMBER(Command->AutoRefreshNumber));
        assert_param(IS_FMC_MODE_REGISTER(Command->ModeRegisterDefinition));

        /* Set command register */
        tmpr = (uint32_t)((Command->CommandMode) | \
            (Command->CommandTarget) | \
            (((Command->AutoRefreshNumber) - 1) << 5) | \
            ((Command->ModeRegisterDefinition) << 9)
            );

        Device->SDCMR = tmpr;

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_SDRAM_SendCommand(SDRAM_HandleTypeDef* hsdram, FMC_SDRAM_CommandTypeDef* Command, uint32_t Timeout)
    {
        /* Check the SDRAM controller state */
        if (hsdram->State == HAL_SDRAM_STATE_BUSY)
        {
            return HAL_BUSY;
        }

