nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* Update the SDRAM state */
        hsdram->State = HAL_SDRAM_STATE_BUSY;

        /* Send SDRAM command */
        FMC_SDRAM_SendCommand(hsdram->Instance, Command, Timeout);

        /* Update the SDRAM controller state state */
        if (Command->CommandMode == FMC_SDRAM_CMD_PALL)
        {
            hsdram->State = HAL_SDRAM_STATE_PRECHARGED;
        }
        else
        {
            hsdram->State = HAL_SDRAM_STATE_READY;
        }

        return HAL_OK;
    }
    
    HAL_StatusTypeDef FMC_SDRAM_ProgramRefreshRate(FMC_SDRAM_TypeDef* Device, uint32_t RefreshRate)
    {
        /* Check the parameters */
        assert_param(IS_FMC_SDRAM_DEVICE(Device));
        assert_param(IS_FMC_REFRESH_RATE(RefreshRate));

        /* Set the refresh rate in command register */
        Device->SDRTR |= (RefreshRate << 1);

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_SDRAM_ProgramRefreshRate(SDRAM_HandleTypeDef* hsdram, uint32_t RefreshRate)
    {
        /* Check the SDRAM controller state */
        if (hsdram->State == HAL_SDRAM_STATE_BUSY)
        {
            return HAL_BUSY;
        }

        /* Update the SDRAM state */
        hsdram->State = HAL_SDRAM_STATE_BUSY;

        /* Program the refresh rate */
        FMC_SDRAM_ProgramRefreshRate(hsdram->Instance, RefreshRate);

        /* Update the SDRAM state */
        hsdram->State = HAL_SDRAM_STATE_READY;

        return HAL_OK;
    }

    void BSP_SDRAM_Initialization_sequence(uint32_t RefreshCount)
    {
        __IO uint32_t tmpmrd = 0;
#define SDRAM_TIMEOUT                    ((uint32_t)0xFFFF)

        /* Step 1: Configure a clock configuration enable command */
        Command.CommandMode = FMC_SDRAM_CMD_CLK_ENABLE;
        Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
        Command.AutoRefreshNumber = 1;
        Command.ModeRegisterDefinition = 0;

        /* Send the command */
        HAL_SDRAM_SendCommand(&sdramHandle, &Command, SDRAM_TIMEOUT);

        /* Step 2: Insert 100 us minimum delay */
        /* Inserted delay is equal to 1 ms due to systick time base unit (ms) */
        wait_ms(1);

        /* Step 3: Configure a PALL (precharge all) command */
        Command.CommandMode = FMC_SDRAM_CMD_PALL;
        Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
        Command.AutoRefreshNumber = 1;
        Command.ModeRegisterDefinition = 0;

        /* Send the command */
        HAL_SDRAM_SendCommand(&sdramHandle, &Command, SDRAM_TIMEOUT);

        /* Step 4: Configure an Auto Refresh command */
        Command.CommandMode = FMC_SDRAM_CMD_AUTOREFRESH_MODE;
        Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
        Command.AutoRefreshNumber = 8;
        Command.ModeRegisterDefinition = 0;

        /* Send the command */
        HAL_SDRAM_SendCommand(&sdramHandle, &Command, SDRAM_TIMEOUT);

        /* Step 5: Program the external memory mode register */
        tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1 | \
            SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL | \
            SDRAM_MODEREG_CAS_LATENCY_3 | \
            SDRAM_MODEREG_OPERATING_MODE_STANDARD | \
            SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;

        Command.CommandMode = FMC_SDRAM_CMD_LOAD_MODE;
        Command.CommandTarget = FMC_SDRAM_CMD_TARGET_BANK1;
        Command.AutoRefreshNumber = 1;
        Command.ModeRegisterDefinition = tmpmrd;

        /* Send the command */
        HAL_SDRAM_SendCommand(&sdramHandle, &Command, SDRAM_TIMEOUT);

        /* Step 6: Set the refresh rate counter */
        /* Set the device refresh rate */
        HAL_SDRAM_ProgramRefreshRate(&sdramHandle, RefreshCount);
    }

    void BSP_SDRAM_MspInit(SDRAM_HandleTypeDef* hsdram, void* Params)
    {

        UNUSED(Params);

        static DMA_HandleTypeDef dma_handle;
        GPIO_InitTypeDef gpio_init_structure;

        /* Enable FMC clock */
        __HAL_RCC_FMC_CLK_ENABLE();

        /* Enable chosen DMAx clock */
        __DMAx_CLK_ENABLE();

        /* Enable GPIOs clock */
        __HAL_RCC_GPIOD_CLK_ENABLE();
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_GPIOF_CLK_ENABLE();
        __HAL_RCC_GPIOG_CLK_ENABLE();
        __HAL_RCC_GPIOH_CLK_ENABLE();
        __HAL_RCC_GPIOI_CLK_ENABLE();

        /* Common GPIO configuration */
        gpio_init_structure.Mode = GPIO_MODE_AF_PP;
        gpio_init_structure.Pull = GPIO_PULLUP;
        gpio_init_structure.Speed = GPIO_SPEED_HIGH;
        gpio_init_structure.Alternate = GPIO_AF12_FMC;

        /* GPIOD configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | \
            GPIO_PIN_14 | GPIO_PIN_15;


        HAL_GPIO_Init(GPIOD, &gpio_init_structure);

        /* GPIOE configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | \
            GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | \
            GPIO_PIN_15;

        HAL_GPIO_Init(GPIOE, &gpio_init_structure);

        /* GPIOF configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | \
            GPIO_PIN_15;

        HAL_GPIO_Init(GPIOF, &gpio_init_structure);

        /* GPIOG configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_8 | GPIO_PIN_15;
        HAL_GPIO_Init(GPIOG, &gpio_init_structure);

        /* GPIOH configuration */
        gpio_init_structure.Pin = GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_5 | GPIO_PIN_8 | GPIO_PIN_9 | \
            GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | \
            GPIO_PIN_15;
        HAL_GPIO_Init(GPIOH, &gpio_init_structure);

        /* GPIOI configuration */
        gpio_init_structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_9 | GPIO_PIN_10;
        HAL_GPIO_Init(GPIOI, &gpio_init_structure);


        dma_handle.Init.PeriphBurst = DMA_PBURST_SINGLE;
        /* Configure common DMA parameters */
        dma_handle.Init.Channel = SDRAM_DMAx_CHANNEL;
        dma_handle.Init.Direction = DMA_MEMORY_TO_MEMORY;
        dma_handle.Init.PeriphInc = DMA_PINC_ENABLE;
        dma_handle.Init.MemInc = DMA_MINC_ENABLE;
        dma_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
        dma_handle.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
        dma_handle.Init.Mode = DMA_NORMAL;
        dma_handle.Init.Priority = DMA_PRIORITY_HIGH;
        dma_handle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        dma_handle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        dma_handle.Init.MemBurst = DMA_MBURST_SINGLE;
        dma_handle.Init.PeriphBurst = DMA_PBURST_SINGLE;

        dma_handle.Instance = SDRAM_DMAx_STREAM;

        /* Associate the DMA handle */
        __HAL_LINKDMA(hsdram, hdma, dma_handle);

        /* Deinitialize the stream for new transfer */
        HAL_DMA_DeInit(&dma_handle);

        /* Configure the DMA stream */
        HAL_DMA_Init(&dma_handle);

