nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(SDRAM_DMAx_IRQn, 0x0F, 0);
        HAL_NVIC_EnableIRQ(SDRAM_DMAx_IRQn);
    }

    uint8_t BSP_SDRAM_Init(void)
    {
        static uint8_t sdramstatus = SDRAM_ERROR;
        /* SDRAM device configuration */
        sdramHandle.Instance = FMC_SDRAM_DEVICE;

        /* Timing configuration for 100Mhz as SDRAM clock frequency (System clock is up to 200Mhz) */
        Timing.LoadToActiveDelay = 2;
        Timing.ExitSelfRefreshDelay = 7;
        Timing.SelfRefreshTime = 4;
        Timing.RowCycleDelay = 7;
        Timing.WriteRecoveryTime = 2;
        Timing.RPDelay = 2;
        Timing.RCDDelay = 2;

        sdramHandle.Init.SDBank = FMC_SDRAM_BANK1;
        sdramHandle.Init.ColumnBitsNumber = FMC_SDRAM_COLUMN_BITS_NUM_8;
        sdramHandle.Init.RowBitsNumber = FMC_SDRAM_ROW_BITS_NUM_12;
        sdramHandle.Init.MemoryDataWidth = SDRAM_MEMORY_WIDTH;
        sdramHandle.Init.InternalBankNumber = FMC_SDRAM_INTERN_BANKS_NUM_4;
        sdramHandle.Init.CASLatency = FMC_SDRAM_CAS_LATENCY_3;
        sdramHandle.Init.WriteProtection = FMC_SDRAM_WRITE_PROTECTION_DISABLE;
        sdramHandle.Init.SDClockPeriod = SDCLOCK_PERIOD;
        sdramHandle.Init.ReadBurst = FMC_SDRAM_RBURST_ENABLE;
        sdramHandle.Init.ReadPipeDelay = FMC_SDRAM_RPIPE_DELAY_0;

        /* SDRAM controller initialization */

        BSP_SDRAM_MspInit(&sdramHandle, NULL); /* __weak function can be rewritten by the application */

        if (HAL_SDRAM_Init(&sdramHandle, &Timing) != HAL_OK)
        {
            sdramstatus = SDRAM_ERROR;
        }
        else
        {
            sdramstatus = SDRAM_OK;
        }

        /* SDRAM initialization sequence */
        BSP_SDRAM_Initialization_sequence(REFRESH_COUNT);

        return sdramstatus;
    }

    void HAL_LTDC_MspInit(LTDC_HandleTypeDef* hltdc)
    {
        UNUSED(hltdc);
        GPIO_InitTypeDef GPIO_Init_Structure;

        /*##-1- Enable peripherals and GPIO Clocks #################################*/
        /*##-1- Enable peripherals and GPIO Clocks #################################*/
        /* Enable the LTDC Clock */
        __HAL_RCC_LTDC_CLK_ENABLE();

        /*##-2- Configure peripheral GPIO ##########################################*/
        /******************** LTDC Pins configuration *************************/
        /* Enable GPIOs clock */
        __HAL_RCC_GPIOE_CLK_ENABLE();
        __HAL_RCC_GPIOG_CLK_ENABLE();
        __HAL_RCC_GPIOI_CLK_ENABLE();
        __HAL_RCC_GPIOJ_CLK_ENABLE();
        __HAL_RCC_GPIOK_CLK_ENABLE();

        /*** LTDC Pins configuration ***/
        /* GPIOE configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_4;
        GPIO_Init_Structure.Mode = GPIO_MODE_AF_PP;
        GPIO_Init_Structure.Pull = GPIO_NOPULL;
        GPIO_Init_Structure.Speed = GPIO_SPEED_FAST;
        GPIO_Init_Structure.Alternate = GPIO_AF14_LTDC;
        HAL_GPIO_Init(GPIOE, &GPIO_Init_Structure);

        /* GPIOG configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_12;
        GPIO_Init_Structure.Mode = GPIO_MODE_AF_PP;
        GPIO_Init_Structure.Alternate = GPIO_AF9_LTDC;
        HAL_GPIO_Init(GPIOG, &GPIO_Init_Structure);

        /* GPIOI LTDC alternate configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_9 | GPIO_PIN_10 | \
            GPIO_PIN_14 | GPIO_PIN_15;
        GPIO_Init_Structure.Mode = GPIO_MODE_AF_PP;
        GPIO_Init_Structure.Alternate = GPIO_AF14_LTDC;
        HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

        /* GPIOJ configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 | \
            GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 | \
            GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | \
            GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
        GPIO_Init_Structure.Mode = GPIO_MODE_AF_PP;
        GPIO_Init_Structure.Alternate = GPIO_AF14_LTDC;
        HAL_GPIO_Init(GPIOJ, &GPIO_Init_Structure);

        /* GPIOK configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | \
            GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
        GPIO_Init_Structure.Mode = GPIO_MODE_AF_PP;
        GPIO_Init_Structure.Alternate = GPIO_AF14_LTDC;
        HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);

        /* LCD_DISP GPIO configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_12;     /* LCD_DISP pin has to be manually controlled */
        GPIO_Init_Structure.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_GPIO_Init(GPIOI, &GPIO_Init_Structure);

        /* LCD_BL_CTRL GPIO configuration */
        GPIO_Init_Structure.Pin = GPIO_PIN_3;  /* LCD_BL_CTRL pin has to be manually controlled */
        GPIO_Init_Structure.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_GPIO_Init(GPIOK, &GPIO_Init_Structure);


        /* Assert display enable LCD_DISP pin */
        HAL_GPIO_WritePin(LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);

        /* Assert backlight LCD_BL_CTRL pin */
        HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);

    }

    static uint32_t DMA_CalcBaseAndBitshift(DMA_HandleTypeDef* hdma)
    {
        uint32_t stream_number = (((uint32_t)hdma->Instance & 0xFFU) - 16U) / 24U;

        /* lookup table for necessary bitshift of flags within status registers */
        static const uint8_t flagBitshiftOffset[8U] = { 0U, 6U, 16U, 22U, 0U, 6U, 16U, 22U };
        hdma->StreamIndex = flagBitshiftOffset[stream_number];

        if (stream_number > 3U)
        {
            /* return pointer to HISR and HIFCR */
            hdma->StreamBaseAddress = (((uint32_t)hdma->Instance & (uint32_t)(~0x3FFU)) + 4U);
        }
        else
        {
            /* return pointer to LISR and LIFCR */
            hdma->StreamBaseAddress = ((uint32_t)hdma->Instance & (uint32_t)(~0x3FFU));
        }

        return hdma->StreamBaseAddress;
    }

    static HAL_StatusTypeDef DMA_CheckFifoParam(DMA_HandleTypeDef* hdma)
    {
        HAL_StatusTypeDef status = HAL_OK;
        uint32_t tmp = hdma->Init.FIFOThreshold;

        /* Memory Data size equal to Byte */
        if (hdma->Init.MemDataAlignment == DMA_MDATAALIGN_BYTE)
        {
            switch (tmp)
            {
            case DMA_FIFO_THRESHOLD_1QUARTERFULL:
            case DMA_FIFO_THRESHOLD_3QUARTERSFULL:
                if ((hdma->Init.MemBurst & DMA_SxCR_MBURST_1) == DMA_SxCR_MBURST_1)
                {
                    status = HAL_ERROR;
                }
                break;
            case DMA_FIFO_THRESHOLD_HALFFULL:
                if (hdma->Init.MemBurst == DMA_MBURST_INC16)
                {
                    status = HAL_ERROR;
                }
                break;
            case DMA_FIFO_THRESHOLD_FULL:
                break;
            default:
                break;
            }
        }

        /* Memory Data size equal to Half-Word */
        else if (hdma->Init.MemDataAlignment == DMA_MDATAALIGN_HALFWORD)
        {
            switch (tmp)
            {
            case DMA_FIFO_THRESHOLD_1QUARTERFULL:
            case DMA_FIFO_THRESHOLD_3QUARTERSFULL:
                status = HAL_ERROR;
                break;
            case DMA_FIFO_THRESHOLD_HALFFULL:
                if ((hdma->Init.MemBurst & DMA_SxCR_MBURST_1) == DMA_SxCR_MBURST_1)
                {
                    status = HAL_ERROR;
                }
                break;
            case DMA_FIFO_THRESHOLD_FULL:
                if (hdma->Init.MemBurst == DMA_MBURST_INC16)
                {
                    status = HAL_ERROR;
                }
                break;
            default:
                break;
            }
        }

