nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* Memory Data size equal to Word */
        else
        {
            switch (tmp)
            {
            case DMA_FIFO_THRESHOLD_1QUARTERFULL:
            case DMA_FIFO_THRESHOLD_HALFFULL:
            case DMA_FIFO_THRESHOLD_3QUARTERSFULL:
                status = HAL_ERROR;
                break;
            case DMA_FIFO_THRESHOLD_FULL:
                if ((hdma->Init.MemBurst & DMA_SxCR_MBURST_1) == DMA_SxCR_MBURST_1)
                {
                    status = HAL_ERROR;
                }
                break;
            default:
                break;
            }
        }

        return status;
    }


    HAL_StatusTypeDef HAL_DMA_DeInit(DMA_HandleTypeDef* hdma)
    {
        DMA_Base_Registers* regs;

        /* Check the DMA peripheral state */
        if (hdma == NULL)
        {
            return HAL_ERROR;
        }

        /* Check the DMA peripheral state */
        if (hdma->State == HAL_DMA_STATE_BUSY)
        {
            /* Return error status */
            return HAL_BUSY;
        }

        /* Check the parameters */
        assert_param(IS_DMA_STREAM_ALL_INSTANCE(hdma->Instance));

        /* Disable the selected DMA Streamx */
        __HAL_DMA_DISABLE(hdma);

        /* Reset DMA Streamx control register */
        hdma->Instance->CR = 0U;

        /* Reset DMA Streamx number of data to transfer register */
        hdma->Instance->NDTR = 0U;

        /* Reset DMA Streamx peripheral address register */
        hdma->Instance->PAR = 0U;

        /* Reset DMA Streamx memory 0 address register */
        hdma->Instance->M0AR = 0U;

        /* Reset DMA Streamx memory 1 address register */
        hdma->Instance->M1AR = 0U;

        /* Reset DMA Streamx FIFO control register */
        hdma->Instance->FCR = (uint32_t)0x00000021U;

        /* Get DMA steam Base Address */
        regs = (DMA_Base_Registers*)DMA_CalcBaseAndBitshift(hdma);

        /* Clear all interrupt flags at correct offset within the register */
        regs->IFCR = 0x3FU << hdma->StreamIndex;

        /* Clean all callbacks */
        hdma->XferCpltCallback = NULL;
        hdma->XferHalfCpltCallback = NULL;
        hdma->XferM1CpltCallback = NULL;
        hdma->XferM1HalfCpltCallback = NULL;
        hdma->XferErrorCallback = NULL;
        hdma->XferAbortCallback = NULL;

        /* Reset the error code */
        hdma->ErrorCode = HAL_DMA_ERROR_NONE;

        /* Reset the DMA state */
        hdma->State = HAL_DMA_STATE_RESET;

        /* Release Lock */
        __HAL_UNLOCK(hdma);

        return HAL_OK;
    }
    HAL_StatusTypeDef HAL_DMA_Init(DMA_HandleTypeDef* hdma)
    {
        uint32_t tmp = 0U;
        uint32_t tickstart = HAL_GetTick();
        DMA_Base_Registers* regs;

        /* Check the DMA peripheral state */
        if (hdma == NULL)
        {
            return HAL_ERROR;
        }

        /* Check the parameters */
        assert_param(IS_DMA_STREAM_ALL_INSTANCE(hdma->Instance));
        assert_param(IS_DMA_CHANNEL(hdma->Init.Channel));
        assert_param(IS_DMA_DIRECTION(hdma->Init.Direction));
        assert_param(IS_DMA_PERIPHERAL_INC_STATE(hdma->Init.PeriphInc));
        assert_param(IS_DMA_MEMORY_INC_STATE(hdma->Init.MemInc));
        assert_param(IS_DMA_PERIPHERAL_DATA_SIZE(hdma->Init.PeriphDataAlignment));
        assert_param(IS_DMA_MEMORY_DATA_SIZE(hdma->Init.MemDataAlignment));
        assert_param(IS_DMA_MODE(hdma->Init.Mode));
        assert_param(IS_DMA_PRIORITY(hdma->Init.Priority));
        assert_param(IS_DMA_FIFO_MODE_STATE(hdma->Init.FIFOMode));
        /* Check the memory burst, peripheral burst and FIFO threshold parameters only
           when FIFO mode is enabled */
        if (hdma->Init.FIFOMode != DMA_FIFOMODE_DISABLE)
        {
            assert_param(IS_DMA_FIFO_THRESHOLD(hdma->Init.FIFOThreshold));
            assert_param(IS_DMA_MEMORY_BURST(hdma->Init.MemBurst));
            assert_param(IS_DMA_PERIPHERAL_BURST(hdma->Init.PeriphBurst));
        }

        /* Allocate lock resource */
        __HAL_UNLOCK(hdma);

        /* Change DMA peripheral state */
        hdma->State = HAL_DMA_STATE_BUSY;

        /* Disable the peripheral */
        __HAL_DMA_DISABLE(hdma);

        /* Check if the DMA Stream is effectively disabled */
        while ((hdma->Instance->CR & DMA_SxCR_EN) != RESET)
        {
            /* Check for the Timeout */
            if ((HAL_GetTick() - tickstart) > HAL_TIMEOUT_DMA_ABORT)
            {
                /* Update error code */
                hdma->ErrorCode = HAL_DMA_ERROR_TIMEOUT;

                /* Change the DMA state */
                hdma->State = HAL_DMA_STATE_TIMEOUT;

                return HAL_TIMEOUT;
            }
        }

        /* Get the CR register value */
        tmp = hdma->Instance->CR;

        /* Clear CHSEL, MBURST, PBURST, PL, MSIZE, PSIZE, MINC, PINC, CIRC, DIR, CT and DBM bits */
        tmp &= ((uint32_t)~(DMA_SxCR_CHSEL | DMA_SxCR_MBURST | DMA_SxCR_PBURST | \
            DMA_SxCR_PL | DMA_SxCR_MSIZE | DMA_SxCR_PSIZE | \
            DMA_SxCR_MINC | DMA_SxCR_PINC | DMA_SxCR_CIRC | \
            DMA_SxCR_DIR | DMA_SxCR_CT | DMA_SxCR_DBM));

        /* Prepare the DMA Stream configuration */
        tmp |= hdma->Init.Channel | hdma->Init.Direction |
            hdma->Init.PeriphInc | hdma->Init.MemInc |
            hdma->Init.PeriphDataAlignment | hdma->Init.MemDataAlignment |
            hdma->Init.Mode | hdma->Init.Priority;

        /* the Memory burst and peripheral burst are not used when the FIFO is disabled */
        if (hdma->Init.FIFOMode == DMA_FIFOMODE_ENABLE)
        {
            /* Get memory burst and peripheral burst */
            tmp |= hdma->Init.MemBurst | hdma->Init.PeriphBurst;
        }

        /* Write to DMA Stream CR register */
        hdma->Instance->CR = tmp;

        /* Get the FCR register value */
        tmp = hdma->Instance->FCR;

        /* Clear Direct mode and FIFO threshold bits */
        tmp &= (uint32_t)~(DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);

        /* Prepare the DMA Stream FIFO configuration */
        tmp |= hdma->Init.FIFOMode;

        /* The FIFO threshold is not used when the FIFO mode is disabled */
        if (hdma->Init.FIFOMode == DMA_FIFOMODE_ENABLE)
        {
            /* Get the FIFO threshold */
            tmp |= hdma->Init.FIFOThreshold;

            /* Check compatibility between FIFO threshold level and size of the memory burst */
            /* for INCR4, INCR8, INCR16 bursts */
            if (hdma->Init.MemBurst != DMA_MBURST_SINGLE)
            {
                if (DMA_CheckFifoParam(hdma) != HAL_OK)
                {
                    /* Update error code */
                    hdma->ErrorCode = HAL_DMA_ERROR_PARAM;

                    /* Change the DMA state */
                    hdma->State = HAL_DMA_STATE_READY;

                    return HAL_ERROR;
                }
            }
        }

        /* Write to DMA Stream FCR */
        hdma->Instance->FCR = tmp;

        /* Initialize StreamBaseAddress and StreamIndex parameters to be used to calculate
           DMA steam Base Address needed by HAL_DMA_IRQHandler() and HAL_DMA_PollForTransfer() */
        regs = (DMA_Base_Registers*)DMA_CalcBaseAndBitshift(hdma);

        /* Clear all interrupt flags */
        regs->IFCR = 0x3FU << hdma->StreamIndex;

        /* Initialize the error code */
        hdma->ErrorCode = HAL_DMA_ERROR_NONE;

        /* Initialize the DMA state */
        hdma->State = HAL_DMA_STATE_READY;

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_LTDC_Init(LTDC_HandleTypeDef* hltdc)
    {
        uint32_t tmp, tmp1;

