nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* Check the LTDC peripheral state */
        if (hltdc == NULL)
        {
            return HAL_ERROR;
        }


        /* Check function parameters */
        assert_param(IS_LTDC_ALL_INSTANCE(hltdc->Instance));
        assert_param(IS_LTDC_HSYNC(hltdc->Init.HorizontalSync));
        assert_param(IS_LTDC_VSYNC(hltdc->Init.VerticalSync));
        assert_param(IS_LTDC_AHBP(hltdc->Init.AccumulatedHBP));
        assert_param(IS_LTDC_AVBP(hltdc->Init.AccumulatedVBP));
        assert_param(IS_LTDC_AAH(hltdc->Init.AccumulatedActiveH));
        assert_param(IS_LTDC_AAW(hltdc->Init.AccumulatedActiveW));
        assert_param(IS_LTDC_TOTALH(hltdc->Init.TotalHeigh));
        assert_param(IS_LTDC_TOTALW(hltdc->Init.TotalWidth));
        assert_param(IS_LTDC_HSPOL(hltdc->Init.HSPolarity));
        assert_param(IS_LTDC_VSPOL(hltdc->Init.VSPolarity));
        assert_param(IS_LTDC_DEPOL(hltdc->Init.DEPolarity));
        assert_param(IS_LTDC_PCPOL(hltdc->Init.PCPolarity));

//#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
//        if (hltdc->State == HAL_LTDC_STATE_RESET)
//        {
//            /* Allocate lock resource and initialize it */
//            hltdc->Lock = HAL_UNLOCKED;
//
//            /* Reset the LTDC callback to the legacy weak callbacks */
//            hltdc->LineEventCallback = HAL_LTDC_LineEventCallback;    /* Legacy weak LineEventCallback    */
//            hltdc->ReloadEventCallback = HAL_LTDC_ReloadEventCallback;  /* Legacy weak ReloadEventCallback  */
//            hltdc->ErrorCallback = HAL_LTDC_ErrorCallback;        /* Legacy weak ErrorCallback        */
//
//            if (hltdc->MspInitCallback == NULL)
//            {
//                hltdc->MspInitCallback = HAL_LTDC_MspInit;
//            }
//            /* Init the low level hardware */
//            hltdc->MspInitCallback(hltdc);
//        }
//#else
        if (hltdc->State == HAL_LTDC_STATE_RESET)
        {
            /* Allocate lock resource and initialize it */
            hltdc->Lock = HAL_UNLOCKED;
            /* Init the low level hardware */
            HAL_LTDC_MspInit(hltdc);
        }
//#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

        /* Change LTDC peripheral state */
        hltdc->State = HAL_LTDC_STATE_BUSY;

        /* Configure the HS, VS, DE and PC polarity */
        hltdc->Instance->GCR &= ~(LTDC_GCR_HSPOL | LTDC_GCR_VSPOL | LTDC_GCR_DEPOL | LTDC_GCR_PCPOL);
        hltdc->Instance->GCR |= (uint32_t)(hltdc->Init.HSPolarity | hltdc->Init.VSPolarity | \
            hltdc->Init.DEPolarity | hltdc->Init.PCPolarity);

        /* Set Synchronization size */
        hltdc->Instance->SSCR &= ~(LTDC_SSCR_VSH | LTDC_SSCR_HSW);
        tmp = (hltdc->Init.HorizontalSync << 16U);
        hltdc->Instance->SSCR |= (tmp | hltdc->Init.VerticalSync);

        /* Set Accumulated Back porch */
        hltdc->Instance->BPCR &= ~(LTDC_BPCR_AVBP | LTDC_BPCR_AHBP);
        tmp = (hltdc->Init.AccumulatedHBP << 16U);
        hltdc->Instance->BPCR |= (tmp | hltdc->Init.AccumulatedVBP);

        /* Set Accumulated Active Width */
        hltdc->Instance->AWCR &= ~(LTDC_AWCR_AAH | LTDC_AWCR_AAW);
        tmp = (hltdc->Init.AccumulatedActiveW << 16U);
        hltdc->Instance->AWCR |= (tmp | hltdc->Init.AccumulatedActiveH);

        /* Set Total Width */
        hltdc->Instance->TWCR &= ~(LTDC_TWCR_TOTALH | LTDC_TWCR_TOTALW);
        tmp = (hltdc->Init.TotalWidth << 16U);
        hltdc->Instance->TWCR |= (tmp | hltdc->Init.TotalHeigh);

        /* Set the background color value */
        tmp = ((uint32_t)(hltdc->Init.Backcolor.Green) << 8U);
        tmp1 = ((uint32_t)(hltdc->Init.Backcolor.Red) << 16U);
        hltdc->Instance->BCCR &= ~(LTDC_BCCR_BCBLUE | LTDC_BCCR_BCGREEN | LTDC_BCCR_BCRED);
        hltdc->Instance->BCCR |= (tmp1 | tmp | hltdc->Init.Backcolor.Blue);

        /* Enable the Transfer Error and FIFO underrun interrupts */
        __HAL_LTDC_ENABLE_IT(hltdc, LTDC_IT_TE | LTDC_IT_FU);

        /* Enable LTDC by setting LTDCEN bit */
        __HAL_LTDC_ENABLE(hltdc);

        /* Initialize the error code */
        hltdc->ErrorCode = HAL_LTDC_ERROR_NONE;

        /* Initialize the LTDC state*/
        hltdc->State = HAL_LTDC_STATE_READY;

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_DSI_Start(DSI_HandleTypeDef* hdsi)
    {
        /* Process locked */
        __HAL_LOCK(hdsi);

        /* Enable the DSI host */
        __HAL_DSI_ENABLE(hdsi);

        /* Enable the DSI wrapper */
        __HAL_DSI_WRAPPER_ENABLE(hdsi);

        /* Process unlocked */
        __HAL_UNLOCK(hdsi);

        return HAL_OK;
    }

    uint8_t BSP_LCD_InitEx(LCD_OrientationTypeDef orientation)
    {
        DSI_PLLInitTypeDef dsiPllInit;
        static RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
        LTDC_HandleTypeDef  hltdc_discovery;

        uint32_t LcdClock = 27429; /*!< LcdClk = 27429 kHz */
    //    uint16_t read_id = 0;

        uint32_t laneByteClk_kHz = 0;
        uint32_t                   VSA; /*!< Vertical start active time in units of lines */
        uint32_t                   VBP; /*!< Vertical Back Porch time in units of lines */
        uint32_t                   VFP; /*!< Vertical Front Porch time in units of lines */
        uint32_t                   VACT; /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */
        uint32_t                   HSA; /*!< Horizontal start active time in units of lcdClk */
        uint32_t                   HBP; /*!< Horizontal Back Porch time in units of lcdClk */
        uint32_t                   HFP; /*!< Horizontal Front Porch time in units of lcdClk */
        uint32_t                   HACT; /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */

        /* Toggle Hardware Reset of the DSI LCD using
        * its XRES signal (active low) */
        BSP_LCD_Reset();
        BSP_LCD_MspInit();

        /*************************DSI Initialization***********************************/

          /* Base address of DSI Host/Wrapper registers to be set before calling De-Init */
        hdsi_discovery.Instance = DSI;

