nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        HAL_DSI_DeInit(&(hdsi_discovery));

        dsiPllInit.PLLNDIV = 100;
        dsiPllInit.PLLIDF = DSI_PLL_IN_DIV5;
        dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;
        laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */

        /* Set number of Lanes */
        hdsi_discovery.Init.NumberOfLanes = DSI_TWO_DATA_LANES;

        /* TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4 */
        hdsi_discovery.Init.TXEscapeCkdiv = laneByteClk_kHz / 15620;

        HAL_DSI_Init(&(hdsi_discovery), &(dsiPllInit));

        // Timing parameters for all Video modes

        HACT = 800;
        VACT = 480;



        /* The following values are same for portrait and landscape orientations */
        VSA = OTM8009A_480X800_VSYNC;        /* 12  */
        VBP = OTM8009A_480X800_VBP;          /* 12  */
        VFP = OTM8009A_480X800_VFP;          /* 12  */
        HSA = OTM8009A_480X800_HSYNC;        /* 63  */
        HBP = OTM8009A_480X800_HBP;          /* 120 */
        HFP = OTM8009A_480X800_HFP;          /* 120 */


        hdsivideo_handle.ColorCoding = LCD_DSI_PIXEL_DATA_FMT_RBG565;
        hdsivideo_handle.VirtualChannelID = LCD_OTM8009A_ID;
        hdsivideo_handle.VSPolarity = DSI_VSYNC_ACTIVE_HIGH;
        hdsivideo_handle.HSPolarity = DSI_HSYNC_ACTIVE_HIGH;
        hdsivideo_handle.DEPolarity = DSI_DATA_ENABLE_ACTIVE_HIGH;
        hdsivideo_handle.Mode = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
        hdsivideo_handle.NullPacketSize = 0xFFF;
        hdsivideo_handle.NumberOfChunks = 0;
        hdsivideo_handle.PacketSize = HACT; /* Value depending on display orientation choice portrait/landscape */
        hdsivideo_handle.HorizontalSyncActive = (HSA * laneByteClk_kHz) / LcdClock;
        hdsivideo_handle.HorizontalBackPorch = (HBP * laneByteClk_kHz) / LcdClock;
        hdsivideo_handle.HorizontalLine = ((HACT + HSA + HBP + HFP) * laneByteClk_kHz) / LcdClock; /* Value depending on display orientation choice portrait/landscape */
        hdsivideo_handle.VerticalSyncActive = VSA;
        hdsivideo_handle.VerticalBackPorch = VBP;
        hdsivideo_handle.VerticalFrontPorch = VFP;
        hdsivideo_handle.VerticalActive = VACT; /* Value depending on display orientation choice portrait/landscape */

        /* Enable or disable sending LP command while streaming is active in video mode */
        hdsivideo_handle.LPCommandEnable = DSI_LP_COMMAND_ENABLE; /* Enable sending commands in mode LP (Low Power) */

        /* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
        /* Only useful when sending LP packets is allowed while streaming is active in video mode */
        hdsivideo_handle.LPLargestPacketSize = 16;

        /* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
        /* Only useful when sending LP packets is allowed while streaming is active in video mode */
        hdsivideo_handle.LPVACTLargestPacketSize = 0;

        /* Specify for each region of the video frame, if the transmission of command in LP mode is allowed in this region */
        /* while streaming is active in video mode                                                                         */
        hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE;   /* Allow sending LP commands during HFP period */
        hdsivideo_handle.LPHorizontalBackPorchEnable = DSI_LP_HBP_ENABLE;   /* Allow sending LP commands during HBP period */
        hdsivideo_handle.LPVerticalActiveEnable = DSI_LP_VACT_ENABLE;  /* Allow sending LP commands during VACT period */
        hdsivideo_handle.LPVerticalFrontPorchEnable = DSI_LP_VFP_ENABLE;   /* Allow sending LP commands during VFP period */
        hdsivideo_handle.LPVerticalBackPorchEnable = DSI_LP_VBP_ENABLE;   /* Allow sending LP commands during VBP period */
        hdsivideo_handle.LPVerticalSyncActiveEnable = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */

        /* Configure DSI Video mode timings with settings set above */
        HAL_DSI_ConfigVideoMode(&(hdsi_discovery), &(hdsivideo_handle));

        /*************************End DSI Initialization*******************************/


        /************************LTDC Initialization***********************************/

          /* Timing Configuration */
        hltdc_discovery.Init.HorizontalSync = (HSA - 1);
        hltdc_discovery.Init.AccumulatedHBP = (HSA + HBP - 1);
        hltdc_discovery.Init.AccumulatedActiveW = (800 + HSA + HBP - 1);
        hltdc_discovery.Init.TotalWidth = (800 + HSA + HBP + HFP - 1);

        /* Initialize the LCD pixel width and pixel height */
        hltdc_discovery.LayerCfg->ImageWidth = 800;
        hltdc_discovery.LayerCfg->ImageHeight = 480;

        /** LCD clock configuration
          * Note: The following values should not be changed as the PLLSAI is also used
          *      to clock the USB FS
          * PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz
          * PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN = 384 Mhz
          * PLLLCDCLK = PLLSAI_VCO Output/PLLSAIR = 384 MHz / 7 = 54.85 MHz
          * LTDC clock frequency = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 54.85 MHz / 2 = 27.429 MHz
          */
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
        PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
        PeriphClkInitStruct.PLLSAI.PLLSAIR = 7;
        PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
        HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);

        /* Background value */
        hltdc_discovery.Init.Backcolor.Blue = 0;
        hltdc_discovery.Init.Backcolor.Green = 0;
        hltdc_discovery.Init.Backcolor.Red = 0;
        hltdc_discovery.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
        hltdc_discovery.Instance = LTDC;

        /* Get LTDC Configuration from DSI Configuration */
        HAL_LTDC_StructInitFromVideoConfig(&(hltdc_discovery), &(hdsivideo_handle));

        /* Initialize the LTDC */
        HAL_LTDC_Init(&hltdc_discovery);

