nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* Enable the DSI host and wrapper after the LTDC initialization
           To avoid any synchronization issue, the DSI shall be started after enabling the LTDC */
        HAL_DSI_Start(&hdsi_discovery);

#if !defined(DATA_IN_ExtSDRAM)
        /* Initialize the SDRAM */
        BSP_SDRAM_Init();
#endif /* DATA_IN_ExtSDRAM */

        /* Initialize the font */
       // BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

        /************************End LTDC Initialization*******************************/


        /***********************OTM8009A Initialization********************************/

          /* Initialize the OTM8009A LCD Display IC Driver (KoD LCD IC Driver)
          *  depending on configuration set in 'hdsivideo_handle'.
          */
        OTM8009A_Init(OTM8009A_FORMAT_RGB888, orientation);

        /***********************End OTM8009A Initialization****************************/

        return LCD_OK;
    }

    void BSP_LCD_LayerDefaultInit(uint32_t LayerIndex, uint32_t FB_Address)
    {
        LCD_LayerCfgTypeDef  Layercfg;

        /* Layer Init */
        Layercfg.WindowX0 = 0;
        Layercfg.WindowX1 = 800;
        Layercfg.WindowY0 = 0;
        Layercfg.WindowY1 = 480;
        Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
        Layercfg.FBStartAdress = FB_Address;
        Layercfg.Alpha = 255;
        Layercfg.Alpha0 = 0;
        Layercfg.Backcolor.Blue = 0;
        Layercfg.Backcolor.Green = 0;
        Layercfg.Backcolor.Red = 0;
        Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
        Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
        Layercfg.ImageWidth = 800;
        Layercfg.ImageHeight = 480;

        HAL_LTDC_ConfigLayer(&hltdc_discovery, &Layercfg, LayerIndex);

        DrawProp[LayerIndex].BackColor = LCD_COLOR_WHITE;
        //     DrawProp[LayerIndex].pFont = &Font24;
        DrawProp[LayerIndex].TextColor = LCD_COLOR_BLACK;
    }

    HAL_StatusTypeDef HAL_LTDC_ConfigLayer(LTDC_HandleTypeDef* hltdc, LTDC_LayerCfgTypeDef* pLayerCfg, uint32_t LayerIdx)
    {

        /* Process locked */
        __HAL_LOCK(hltdc);

        /* Change LTDC peripheral state */
        hltdc->State = HAL_LTDC_STATE_BUSY;

        /* Copy new layer configuration into handle structure */
        hltdc->LayerCfg[LayerIdx] = *pLayerCfg;

        /* Configure the LTDC Layer */
        LTDC_SetConfig(hltdc, pLayerCfg, LayerIdx);

        /* Set the Immediate Reload type */
        hltdc->Instance->SRCR = LTDC_SRCR_IMR;

        /* Initialize the LTDC state*/
        hltdc->State = HAL_LTDC_STATE_READY;

        /* Process unlocked */
        __HAL_UNLOCK(hltdc);

        return HAL_OK;
    }

    static void LTDC_SetConfig(LTDC_HandleTypeDef* hltdc, LTDC_LayerCfgTypeDef* pLayerCfg, uint32_t LayerIdx)
    {
        uint32_t tmp;
        uint32_t tmp1;
        uint32_t tmp2;

        /* Configure the horizontal start and stop position */
        tmp = ((pLayerCfg->WindowX1 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U)) << 16U);
        LTDC_LAYER(hltdc, LayerIdx)->WHPCR &= ~(LTDC_LxWHPCR_WHSTPOS | LTDC_LxWHPCR_WHSPPOS);
        LTDC_LAYER(hltdc, LayerIdx)->WHPCR = ((pLayerCfg->WindowX0 + ((hltdc->Instance->BPCR & LTDC_BPCR_AHBP) >> 16U) + 1U) | tmp);

        /* Configure the vertical start and stop position */
        tmp = ((pLayerCfg->WindowY1 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP)) << 16U);
        LTDC_LAYER(hltdc, LayerIdx)->WVPCR &= ~(LTDC_LxWVPCR_WVSTPOS | LTDC_LxWVPCR_WVSPPOS);
        LTDC_LAYER(hltdc, LayerIdx)->WVPCR = ((pLayerCfg->WindowY0 + (hltdc->Instance->BPCR & LTDC_BPCR_AVBP) + 1U) | tmp);

        /* Specifies the pixel format */
        LTDC_LAYER(hltdc, LayerIdx)->PFCR &= ~(LTDC_LxPFCR_PF);
        LTDC_LAYER(hltdc, LayerIdx)->PFCR = (pLayerCfg->PixelFormat);

        /* Configure the default color values */
        tmp = ((uint32_t)(pLayerCfg->Backcolor.Green) << 8U);
        tmp1 = ((uint32_t)(pLayerCfg->Backcolor.Red) << 16U);
        tmp2 = (pLayerCfg->Alpha0 << 24U);
        LTDC_LAYER(hltdc, LayerIdx)->DCCR &= ~(LTDC_LxDCCR_DCBLUE | LTDC_LxDCCR_DCGREEN | LTDC_LxDCCR_DCRED | LTDC_LxDCCR_DCALPHA);
        LTDC_LAYER(hltdc, LayerIdx)->DCCR = (pLayerCfg->Backcolor.Blue | tmp | tmp1 | tmp2);

        /* Specifies the constant alpha value */
        LTDC_LAYER(hltdc, LayerIdx)->CACR &= ~(LTDC_LxCACR_CONSTA);
        LTDC_LAYER(hltdc, LayerIdx)->CACR = (pLayerCfg->Alpha);

        /* Specifies the blending factors */
        LTDC_LAYER(hltdc, LayerIdx)->BFCR &= ~(LTDC_LxBFCR_BF2 | LTDC_LxBFCR_BF1);
        LTDC_LAYER(hltdc, LayerIdx)->BFCR = (pLayerCfg->BlendingFactor1 | pLayerCfg->BlendingFactor2);

        /* Configure the color frame buffer start address */
        LTDC_LAYER(hltdc, LayerIdx)->CFBAR &= ~(LTDC_LxCFBAR_CFBADD);
        LTDC_LAYER(hltdc, LayerIdx)->CFBAR = (pLayerCfg->FBStartAdress);

        if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888)
        {
            tmp = 4U;
        }
        else if (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB888)
        {
            tmp = 3U;
        }
        else if ((pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
            (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
            (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_ARGB1555) || \
            (pLayerCfg->PixelFormat == LTDC_PIXEL_FORMAT_AL88))
        {
            tmp = 2U;
        }
        else
        {
            tmp = 1U;
        }

        /* Configure the color frame buffer pitch in byte */
        LTDC_LAYER(hltdc, LayerIdx)->CFBLR &= ~(LTDC_LxCFBLR_CFBLL | LTDC_LxCFBLR_CFBP);
        LTDC_LAYER(hltdc, LayerIdx)->CFBLR = (((pLayerCfg->ImageWidth * tmp) << 16U) | (((pLayerCfg->WindowX1 - pLayerCfg->WindowX0) * tmp) + 3U));
        /* Configure the frame buffer line number */
        LTDC_LAYER(hltdc, LayerIdx)->CFBLNR &= ~(LTDC_LxCFBLNR_CFBLNBR);
        LTDC_LAYER(hltdc, LayerIdx)->CFBLNR = (pLayerCfg->ImageHeight);

        /* Enable LTDC_Layer by setting LEN bit */
        LTDC_LAYER(hltdc, LayerIdx)->CR |= (uint32_t)LTDC_LxCR_LEN;
    }

    void HAL_GPIO_WritePin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState)
    {
        /* Check the parameters */
        assert_param(IS_GPIO_PIN(GPIO_Pin));
        assert_param(IS_GPIO_PIN_ACTION(PinState));

        if (PinState != GPIO_PIN_RESET)
        {
            GPIOx->BSRR = GPIO_Pin;
        }
        else
        {
            GPIOx->BSRR = (uint32_t)GPIO_Pin << 16;
        }
    }

    void BSP_LCD_Reset(void)
    {
        GPIO_InitTypeDef  gpio_init_structure;

