nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        __HAL_RCC_GPIOJ_CLK_ENABLE();

        /* Configure the GPIO on PJ15 */
        gpio_init_structure.Pin = GPIO_PIN_15;
        gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
        gpio_init_structure.Pull = GPIO_PULLUP;
        gpio_init_structure.Speed = GPIO_SPEED_HIGH;

        HAL_GPIO_Init(GPIOJ, &gpio_init_structure);

        /* Activate XRES active low */
        HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_15, GPIO_PIN_RESET);

        wait_ms(20); /* wait 20 ms */

        /* Desactivate XRES */
        HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_15, GPIO_PIN_SET);

        /* Wait for 10ms after releasing XRES before sending commands */
        wait_ms(10);
    }

    HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(RCC_PeriphCLKInitTypeDef* PeriphClkInit)
    {
        uint32_t tickstart = 0;
        uint32_t tmpreg0 = 0;
        uint32_t tmpreg1 = 0;
        uint32_t plli2sused = 0;
        uint32_t pllsaiused = 0;

        /* Check the parameters */
        assert_param(IS_RCC_PERIPHCLOCK(PeriphClkInit->PeriphClockSelection));

        /*-------------------------------------- I2C1 Configuration -----------------------------------*/
        if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_I2C1) == RCC_PERIPHCLK_I2C1)
        {
            /* Check the parameters */
            assert_param(IS_RCC_I2C1CLKSOURCE(PeriphClkInit->I2c1ClockSelection));

            /* Configure the I2C1 clock source */
            __HAL_RCC_I2C1_CONFIG(PeriphClkInit->I2c1ClockSelection);
        }

        /*-------------------------------------- I2C2 Configuration -----------------------------------*/
        if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_I2C2) == RCC_PERIPHCLK_I2C2)
        {
            /* Check the parameters */
            assert_param(IS_RCC_I2C2CLKSOURCE(PeriphClkInit->I2c2ClockSelection));

            /* Configure the I2C2 clock source */
            __HAL_RCC_I2C2_CONFIG(PeriphClkInit->I2c2ClockSelection);
        }

        /*-------------------------------------- I2C3 Configuration -----------------------------------*/
        if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_I2C3) == RCC_PERIPHCLK_I2C3)
        {
            /* Check the parameters */
            assert_param(IS_RCC_I2C3CLKSOURCE(PeriphClkInit->I2c3ClockSelection));

            /* Configure the I2C3 clock source */
            __HAL_RCC_I2C3_CONFIG(PeriphClkInit->I2c3ClockSelection);
        }

        /*-------------------------------------- I2C4 Configuration -----------------------------------*/
        if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_I2C4) == RCC_PERIPHCLK_I2C4)
        {
            /* Check the parameters */
            assert_param(IS_RCC_I2C4CLKSOURCE(PeriphClkInit->I2c4ClockSelection));

            /* Configure the I2C4 clock source */
            __HAL_RCC_I2C4_CONFIG(PeriphClkInit->I2c4ClockSelection);
        }


        /*-------------------------------------- LTDC Configuration -----------------------------------*/
        if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_LTDC) == RCC_PERIPHCLK_LTDC)
        {
            pllsaiused = 1;
        }




        /*-------------------------------------- PLLI2S Configuration ---------------------------------*/
        /* PLLI2S is configured when a peripheral will use it as source clock : SAI1, SAI2, I2S or SPDIF-RX */
        if ((plli2sused == 1) || (PeriphClkInit->PeriphClockSelection == RCC_PERIPHCLK_PLLI2S))
        {
            /* Disable the PLLI2S */
            __HAL_RCC_PLLI2S_DISABLE();

            /* Get Start Tick*/
            tickstart = HAL_GetTick();

            /* Wait till PLLI2S is disabled */
            while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLLI2SRDY) != RESET)
            {
                if ((HAL_GetTick() - tickstart) > PLLI2S_TIMEOUT_VALUE)
                {
                    /* return in case of Timeout detected */
                    return HAL_TIMEOUT;
                }
            }

            /* check for common PLLI2S Parameters */
            assert_param(IS_RCC_PLLI2SN_VALUE(PeriphClkInit->PLLI2S.PLLI2SN));

            /*----------------- In Case of PLLI2S is selected as source clock for I2S -------------------*/
            if (((((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_I2S) == RCC_PERIPHCLK_I2S) && (PeriphClkInit->I2sClockSelection == RCC_I2SCLKSOURCE_PLLI2S)))
            {
                /* check for Parameters */
                assert_param(IS_RCC_PLLI2SR_VALUE(PeriphClkInit->PLLI2S.PLLI2SR));

                /* Read PLLI2SP and PLLI2SQ value from PLLI2SCFGR register (this value is not needed for I2S configuration) */
                tmpreg0 = ((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SP) >> RCC_PLLI2SCFGR_PLLI2SP_Pos);
                tmpreg1 = ((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SQ) >> RCC_PLLI2SCFGR_PLLI2SQ_Pos);
                /* Configure the PLLI2S division factors */
                /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) x (PLLI2SN/PLLM) */
                /* I2SCLK = f(PLLI2S clock output) = f(VCO clock) / PLLI2SR */
                __HAL_RCC_PLLI2S_CONFIG(PeriphClkInit->PLLI2S.PLLI2SN, tmpreg0, tmpreg1, PeriphClkInit->PLLI2S.PLLI2SR);
            }

            /*----------------- In Case of PLLI2S is selected as source clock for SAI -------------------*/
            if (((((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_SAI1) == RCC_PERIPHCLK_SAI1) && (PeriphClkInit->Sai1ClockSelection == RCC_SAI1CLKSOURCE_PLLI2S)) ||
                ((((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_SAI2) == RCC_PERIPHCLK_SAI2) && (PeriphClkInit->Sai2ClockSelection == RCC_SAI2CLKSOURCE_PLLI2S)))
            {
                /* Check for PLLI2S Parameters */
                assert_param(IS_RCC_PLLI2SQ_VALUE(PeriphClkInit->PLLI2S.PLLI2SQ));
                /* Check for PLLI2S/DIVQ parameters */
                assert_param(IS_RCC_PLLI2S_DIVQ_VALUE(PeriphClkInit->PLLI2SDivQ));

                /* Read PLLI2SP and PLLI2SR values from PLLI2SCFGR register (this value is not needed for SAI configuration) */
                tmpreg0 = ((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SP) >> RCC_PLLI2SCFGR_PLLI2SP_Pos);
                tmpreg1 = ((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SR) >> RCC_PLLI2SCFGR_PLLI2SR_Pos);
                /* Configure the PLLI2S division factors */
                /* PLLI2S_VCO Input  = PLL_SOURCE/PLLM */
                /* PLLI2S_VCO Output = PLLI2S_VCO Input * PLLI2SN */
                /* SAI_CLK(first level) = PLLI2S_VCO Output/PLLI2SQ */
                __HAL_RCC_PLLI2S_CONFIG(PeriphClkInit->PLLI2S.PLLI2SN, tmpreg0, PeriphClkInit->PLLI2S.PLLI2SQ, tmpreg1);

                /* SAI_CLK_x = SAI_CLK(first level)/PLLI2SDIVQ */
                __HAL_RCC_PLLI2S_PLLSAICLKDIVQ_CONFIG(PeriphClkInit->PLLI2SDivQ);
            }

