nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
            /*----------------- In Case of PLLI2S is selected as source clock for SPDIF-RX -------------------*/
            if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_SPDIFRX) == RCC_PERIPHCLK_SPDIFRX)
            {
                /* check for Parameters */
                assert_param(IS_RCC_PLLI2SP_VALUE(PeriphClkInit->PLLI2S.PLLI2SP));

                /* Read PLLI2SR value from PLLI2SCFGR register (this value is not needed for SPDIF-RX configuration) */
                tmpreg0 = ((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SQ) >> RCC_PLLI2SCFGR_PLLI2SQ_Pos);
                tmpreg1 = ((RCC->PLLI2SCFGR & RCC_PLLI2SCFGR_PLLI2SR) >> RCC_PLLI2SCFGR_PLLI2SR_Pos);
                /* Configure the PLLI2S division factors */
                /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) x (PLLI2SN/PLLM) */
                /* SPDIFCLK = f(PLLI2S clock output) = f(VCO clock) / PLLI2SP */
                __HAL_RCC_PLLI2S_CONFIG(PeriphClkInit->PLLI2S.PLLI2SN, PeriphClkInit->PLLI2S.PLLI2SP, tmpreg0, tmpreg1);
            }

            /*----------------- In Case of PLLI2S is just selected  -----------------*/
            if ((PeriphClkInit->PeriphClockSelection & RCC_PERIPHCLK_PLLI2S) == RCC_PERIPHCLK_PLLI2S)
            {
                /* Check for Parameters */
                assert_param(IS_RCC_PLLI2SP_VALUE(PeriphClkInit->PLLI2S.PLLI2SP));
                assert_param(IS_RCC_PLLI2SR_VALUE(PeriphClkInit->PLLI2S.PLLI2SR));
                assert_param(IS_RCC_PLLI2SQ_VALUE(PeriphClkInit->PLLI2S.PLLI2SQ));

                /* Configure the PLLI2S division factors */
                /* PLLI2S_VCO = f(VCO clock) = f(PLLI2S clock input) x (PLLI2SN/PLLI2SM) */
                /* SPDIFRXCLK = f(PLLI2S clock output) = f(VCO clock) / PLLI2SP */
                __HAL_RCC_PLLI2S_CONFIG(PeriphClkInit->PLLI2S.PLLI2SN, PeriphClkInit->PLLI2S.PLLI2SP, PeriphClkInit->PLLI2S.PLLI2SQ, PeriphClkInit->PLLI2S.PLLI2SR);
            }

            /* Enable the PLLI2S */
            __HAL_RCC_PLLI2S_ENABLE();

            /* Get Start Tick*/
            tickstart = HAL_GetTick();

            /* Wait till PLLI2S is ready */
            while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLLI2SRDY) == RESET)
            {
                if ((HAL_GetTick() - tickstart) > PLLI2S_TIMEOUT_VALUE)
                {
                    /* return in case of Timeout detected */
                    return HAL_TIMEOUT;
                }
            }
        }

        /*-------------------------------------- PLLSAI Configuration ---------------------------------*/
        /* PLLSAI is configured when a peripheral will use it as source clock : SAI1, SAI2, LTDC or CK48 */
        if (pllsaiused == 1)
        {
            /* Disable PLLSAI Clock */
            __HAL_RCC_PLLSAI_DISABLE();

            /* Get Start Tick*/
            tickstart = HAL_GetTick();

            /* Wait till PLLSAI is disabled */
            while (__HAL_RCC_PLLSAI_GET_FLAG() != RESET)
            {
                if ((HAL_GetTick() - tickstart) > PLLSAI_TIMEOUT_VALUE)
                {
                    /* return in case of Timeout detected */
                    return HAL_TIMEOUT;
                }
            }

            /* Check the PLLSAI division factors */
            assert_param(IS_RCC_PLLSAIN_VALUE(PeriphClkInit->PLLSAI.PLLSAIN));

            /*----------------- In Case of PLLSAI is selected as source clock for SAI -------------------*/
            if (((((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_SAI1) == RCC_PERIPHCLK_SAI1) && (PeriphClkInit->Sai1ClockSelection == RCC_SAI1CLKSOURCE_PLLSAI)) || \
                ((((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_SAI2) == RCC_PERIPHCLK_SAI2) && (PeriphClkInit->Sai2ClockSelection == RCC_SAI2CLKSOURCE_PLLSAI)))
            {
                /* check for PLLSAIQ Parameter */
                assert_param(IS_RCC_PLLSAIQ_VALUE(PeriphClkInit->PLLSAI.PLLSAIQ));
                /* check for PLLSAI/DIVQ Parameter */
                assert_param(IS_RCC_PLLSAI_DIVQ_VALUE(PeriphClkInit->PLLSAIDivQ));

                /* Read PLLSAIP value from PLLSAICFGR register (this value is not needed for SAI configuration) */
                tmpreg0 = ((RCC->PLLSAICFGR & RCC_PLLSAICFGR_PLLSAIP) >> RCC_PLLSAICFGR_PLLSAIP_Pos);
                tmpreg1 = ((RCC->PLLSAICFGR & RCC_PLLI2SCFGR_PLLI2SR) >> RCC_PLLSAICFGR_PLLSAIR_Pos);
                /* PLLSAI_VCO Input  = PLL_SOURCE/PLLM */
                /* PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN */
                /* SAI_CLK(first level) = PLLSAI_VCO Output/PLLSAIQ */
                __HAL_RCC_PLLSAI_CONFIG(PeriphClkInit->PLLSAI.PLLSAIN, tmpreg0, PeriphClkInit->PLLSAI.PLLSAIQ, tmpreg1);

                /* SAI_CLK_x = SAI_CLK(first level)/PLLSAIDIVQ */
                __HAL_RCC_PLLSAI_PLLSAICLKDIVQ_CONFIG(PeriphClkInit->PLLSAIDivQ);
            }

            /*----------------- In Case of PLLSAI is selected as source clock for CLK48 -------------------*/
            /* In Case of PLLI2S is selected as source clock for CK48 */
            if ((((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_CLK48) == RCC_PERIPHCLK_CLK48) && (PeriphClkInit->Clk48ClockSelection == RCC_CLK48SOURCE_PLLSAIP))
            {
                /* check for Parameters */
                assert_param(IS_RCC_PLLSAIP_VALUE(PeriphClkInit->PLLSAI.PLLSAIP));
                /* Read PLLSAIQ and PLLSAIR value from PLLSAICFGR register (this value is not needed for CK48 configuration) */
                tmpreg0 = ((RCC->PLLSAICFGR & RCC_PLLSAICFGR_PLLSAIQ) >> RCC_PLLSAICFGR_PLLSAIQ_Pos);
                tmpreg1 = ((RCC->PLLSAICFGR & RCC_PLLSAICFGR_PLLSAIR) >> RCC_PLLSAICFGR_PLLSAIR_Pos);

                /* Configure the PLLSAI division factors */
                /* PLLSAI_VCO = f(VCO clock) = f(PLLSAI clock input) x (PLLI2SN/PLLM) */
                /* 48CLK = f(PLLSAI clock output) = f(VCO clock) / PLLSAIP */
                __HAL_RCC_PLLSAI_CONFIG(PeriphClkInit->PLLSAI.PLLSAIN, PeriphClkInit->PLLSAI.PLLSAIP, tmpreg0, tmpreg1);
            }

            /*---------------------------- LTDC configuration -------------------------------*/
            if (((PeriphClkInit->PeriphClockSelection) & RCC_PERIPHCLK_LTDC) == (RCC_PERIPHCLK_LTDC))
            {
                assert_param(IS_RCC_PLLSAIR_VALUE(PeriphClkInit->PLLSAI.PLLSAIR));
                assert_param(IS_RCC_PLLSAI_DIVR_VALUE(PeriphClkInit->PLLSAIDivR));

                /* Read PLLSAIP and PLLSAIQ value from PLLSAICFGR register (these value are not needed for LTDC configuration) */
                tmpreg0 = ((RCC->PLLSAICFGR & RCC_PLLSAICFGR_PLLSAIQ) >> RCC_PLLSAICFGR_PLLSAIQ_Pos);
                tmpreg1 = ((RCC->PLLSAICFGR & RCC_PLLSAICFGR_PLLSAIP) >> RCC_PLLSAICFGR_PLLSAIP_Pos);

