nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
                /* PLLSAI_VCO Input  = PLL_SOURCE/PLLM */
                /* PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN */
                /* LTDC_CLK(first level) = PLLSAI_VCO Output/PLLSAIR */
                __HAL_RCC_PLLSAI_CONFIG(PeriphClkInit->PLLSAI.PLLSAIN, tmpreg1, tmpreg0, PeriphClkInit->PLLSAI.PLLSAIR);

                /* LTDC_CLK = LTDC_CLK(first level)/PLLSAIDIVR */
                __HAL_RCC_PLLSAI_PLLSAICLKDIVR_CONFIG(PeriphClkInit->PLLSAIDivR);
            }

            /* Enable PLLSAI Clock */
            __HAL_RCC_PLLSAI_ENABLE();

            /* Get Start Tick*/
            tickstart = HAL_GetTick();

            /* Wait till PLLSAI is ready */
            while (__HAL_RCC_PLLSAI_GET_FLAG() == RESET)
            {
                if ((HAL_GetTick() - tickstart) > PLLSAI_TIMEOUT_VALUE)
                {
                    /* return in case of Timeout detected */
                    return HAL_TIMEOUT;
                }
            }
        }
        return HAL_OK;
    }

    void BSP_LCD_MspInit(void)
    {
        /** @brief Enable the LTDC clock */
        __HAL_RCC_LTDC_CLK_ENABLE();

        /** @brief Toggle Sw reset of LTDC IP */
        __HAL_RCC_LTDC_FORCE_RESET();
        __HAL_RCC_LTDC_RELEASE_RESET();

        /** @brief Enable the DMA2D clock */
        __HAL_RCC_DMA2D_CLK_ENABLE();

        /** @brief Toggle Sw reset of DMA2D IP */
        __HAL_RCC_DMA2D_FORCE_RESET();
        __HAL_RCC_DMA2D_RELEASE_RESET();

        /** @brief Enable DSI Host and wrapper clocks */
        __HAL_RCC_DSI_CLK_ENABLE();

        /** @brief Soft Reset the DSI Host and wrapper */
        __HAL_RCC_DSI_FORCE_RESET();
        __HAL_RCC_DSI_RELEASE_RESET();

        /** @brief NVIC configuration for LTDC interrupt that is now enabled */
        HAL_NVIC_SetPriority(LTDC_IRQn, 3, 0);
        HAL_NVIC_EnableIRQ(LTDC_IRQn);

        /** @brief NVIC configuration for DMA2D interrupt that is now enabled */
        HAL_NVIC_SetPriority(DMA2D_IRQn, 3, 0);
        HAL_NVIC_EnableIRQ(DMA2D_IRQn);

        /** @brief NVIC configuration for DSI interrupt that is now enabled */
        HAL_NVIC_SetPriority(DSI_IRQn, 3, 0);
        HAL_NVIC_EnableIRQ(DSI_IRQn);
    }

    uint8_t BSP_TS_Init(void)
    {
        uint8_t ts_status = TS_OK;
        uint8_t ts_id1, ts_id2 = 0;
        /* Note : I2C_Address is un-initialized here, but is not used at all in init function */
        /* but the prototype of Init() is like that in template and should be respected       */

        /* Initialize the communication channel to sensor (I2C) if necessary */
        /* that is initialization is done only once after a power up         */
        ft6x06_ts_drv.Init(I2C_Address);

        ts_id1 = ft6x06_ts_drv.ReadID(TS_I2C_ADDRESS);
        if (ts_id1 != FT6206_ID_VALUE)
        {
            ts_id2 = ft6x06_ts_drv.ReadID(TS_I2C_ADDRESS_A02);
            I2C_Address = TS_I2C_ADDRESS_A02;
        }
        else
        {
            I2C_Address = TS_I2C_ADDRESS;
        }

        /* Scan FT6xx6 TouchScreen IC controller ID register by I2C Read       */
        /* Verify this is a FT6206 or FT6336G, otherwise this is an error case */
        if ((ts_id1 == FT6206_ID_VALUE) || (ts_id2 == FT6206_ID_VALUE))
        {
            /* Found FT6206 : Initialize the TS driver structure */
            ts_driver = &ft6x06_ts_drv;

            /* Get LCD chosen orientation */
            if (800 < 480)
            {
                ts_orientation = TS_SWAP_NONE;
            }
            else
            {
                ts_orientation = TS_SWAP_XY | TS_SWAP_Y;
            }

            if (ts_status == TS_OK)
            {
                /* Software reset the TouchScreen */
                ts_driver->Reset(I2C_Address);

                /* Calibrate, Configure and Start the TouchScreen driver */
                ts_driver->Start(I2C_Address);

            } /* of if(ts_status == TS_OK) */
        }
        else
        {
            ts_status = TS_DEVICE_NOT_FOUND;
        }

        return (ts_status);
    }

    void HAL_NVIC_SetPriority(IRQn_Type IRQn, uint32_t PreemptPriority, uint32_t SubPriority)
    {
        uint32_t prioritygroup = 0x00;

        /* Check the parameters */
        assert_param(IS_NVIC_SUB_PRIORITY(SubPriority));
        assert_param(IS_NVIC_PREEMPTION_PRIORITY(PreemptPriority));

        prioritygroup = NVIC_GetPriorityGrouping();

        NVIC_SetPriority(IRQn, NVIC_EncodePriority(prioritygroup, PreemptPriority, SubPriority));
    }

    HAL_StatusTypeDef HAL_DSI_DeInit(DSI_HandleTypeDef* hdsi)
    {
        /* Check the DSI handle allocation */
        if (hdsi == NULL)
        {
            return HAL_ERROR;
        }

        /* Change DSI peripheral state */
        hdsi->State = HAL_DSI_STATE_BUSY;

        /* Disable the DSI wrapper */
        __HAL_DSI_WRAPPER_DISABLE(hdsi);

        /* Disable the DSI host */
        __HAL_DSI_DISABLE(hdsi);

        /* D-PHY clock and digital disable */
        hdsi->Instance->PCTLR &= ~(DSI_PCTLR_CKE | DSI_PCTLR_DEN);

        /* Turn off the DSI PLL */
        __HAL_DSI_PLL_DISABLE(hdsi);

        /* Disable the regulator */
        __HAL_DSI_REG_DISABLE(hdsi);

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
        if (hdsi->MspDeInitCallback == NULL)
        {
            hdsi->MspDeInitCallback = HAL_DSI_MspDeInit;
        }
        /* DeInit the low level hardware */
        hdsi->MspDeInitCallback(hdsi);
#else
        /* DeInit the low level hardware */
        HAL_DSI_MspDeInit(hdsi);
#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

        /* Initialise the error code */
        hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

        /* Initialize the DSI state*/
        hdsi->State = HAL_DSI_STATE_RESET;

        /* Release Lock */
        __HAL_UNLOCK(hdsi);

        return HAL_OK;
    }

    void HAL_DSI_MspDeInit(DSI_HandleTypeDef* hdsi)
    {
        /* Prevent unused argument(s) compilation warning */
        UNUSED(hdsi);
        /* NOTE : This function Should not be modified, when the callback is needed,
                  the HAL_DSI_MspDeInit could be implemented in the user file
         */
    }

    HAL_StatusTypeDef HAL_DSI_ConfigVideoMode(DSI_HandleTypeDef* hdsi, DSI_VidCfgTypeDef* VidCfg)
    {
        /* Process locked */
        __HAL_LOCK(hdsi);

        /* Check the parameters */
        assert_param(IS_DSI_COLOR_CODING(VidCfg->ColorCoding));
        assert_param(IS_DSI_VIDEO_MODE_TYPE(VidCfg->Mode));
        assert_param(IS_DSI_LP_COMMAND(VidCfg->LPCommandEnable));
        assert_param(IS_DSI_LP_HFP(VidCfg->LPHorizontalFrontPorchEnable));
        assert_param(IS_DSI_LP_HBP(VidCfg->LPHorizontalBackPorchEnable));
        assert_param(IS_DSI_LP_VACTIVE(VidCfg->LPVerticalActiveEnable));
        assert_param(IS_DSI_LP_VFP(VidCfg->LPVerticalFrontPorchEnable));
        assert_param(IS_DSI_LP_VBP(VidCfg->LPVerticalBackPorchEnable));
        assert_param(IS_DSI_LP_VSYNC(VidCfg->LPVerticalSyncActiveEnable));
        assert_param(IS_DSI_FBTAA(VidCfg->FrameBTAAcknowledgeEnable));
        assert_param(IS_DSI_DE_POLARITY(VidCfg->DEPolarity));
        assert_param(IS_DSI_VSYNC_POLARITY(VidCfg->VSPolarity));
        assert_param(IS_DSI_HSYNC_POLARITY(VidCfg->HSPolarity));
        /* Check the LooselyPacked variant only in 18-bit mode */
        if (VidCfg->ColorCoding == DSI_RGB666)
        {
            assert_param(IS_DSI_LOOSELY_PACKED(VidCfg->LooselyPacked));
        }

