nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* Select video mode by resetting CMDM and DSIM bits */
        hdsi->Instance->MCR &= ~DSI_MCR_CMDM;
        hdsi->Instance->WCFGR &= ~DSI_WCFGR_DSIM;

        /* Configure the video mode transmission type */
        hdsi->Instance->VMCR &= ~DSI_VMCR_VMT;
        hdsi->Instance->VMCR |= VidCfg->Mode;

        /* Configure the video packet size */
        hdsi->Instance->VPCR &= ~DSI_VPCR_VPSIZE;
        hdsi->Instance->VPCR |= VidCfg->PacketSize;

        /* Set the chunks number to be transmitted through the DSI link */
        hdsi->Instance->VCCR &= ~DSI_VCCR_NUMC;
        hdsi->Instance->VCCR |= VidCfg->NumberOfChunks;

        /* Set the size of the null packet */
        hdsi->Instance->VNPCR &= ~DSI_VNPCR_NPSIZE;
        hdsi->Instance->VNPCR |= VidCfg->NullPacketSize;

        /* Select the virtual channel for the LTDC interface traffic */
        hdsi->Instance->LVCIDR &= ~DSI_LVCIDR_VCID;
        hdsi->Instance->LVCIDR |= VidCfg->VirtualChannelID;

        /* Configure the polarity of control signals */
        hdsi->Instance->LPCR &= ~(DSI_LPCR_DEP | DSI_LPCR_VSP | DSI_LPCR_HSP);
        hdsi->Instance->LPCR |= (VidCfg->DEPolarity | VidCfg->VSPolarity | VidCfg->HSPolarity);

        /* Select the color coding for the host */
        hdsi->Instance->LCOLCR &= ~DSI_LCOLCR_COLC;
        hdsi->Instance->LCOLCR |= VidCfg->ColorCoding;

        /* Select the color coding for the wrapper */
        hdsi->Instance->WCFGR &= ~DSI_WCFGR_COLMUX;
        hdsi->Instance->WCFGR |= ((VidCfg->ColorCoding) << 1U);

        /* Enable/disable the loosely packed variant to 18-bit configuration */
        if (VidCfg->ColorCoding == DSI_RGB666)
        {
            hdsi->Instance->LCOLCR &= ~DSI_LCOLCR_LPE;
            hdsi->Instance->LCOLCR |= VidCfg->LooselyPacked;
        }

        /* Set the Horizontal Synchronization Active (HSA) in lane byte clock cycles */
        hdsi->Instance->VHSACR &= ~DSI_VHSACR_HSA;
        hdsi->Instance->VHSACR |= VidCfg->HorizontalSyncActive;

        /* Set the Horizontal Back Porch (HBP) in lane byte clock cycles */
        hdsi->Instance->VHBPCR &= ~DSI_VHBPCR_HBP;
        hdsi->Instance->VHBPCR |= VidCfg->HorizontalBackPorch;

        /* Set the total line time (HLINE=HSA+HBP+HACT+HFP) in lane byte clock cycles */
        hdsi->Instance->VLCR &= ~DSI_VLCR_HLINE;
        hdsi->Instance->VLCR |= VidCfg->HorizontalLine;

        /* Set the Vertical Synchronization Active (VSA) */
        hdsi->Instance->VVSACR &= ~DSI_VVSACR_VSA;
        hdsi->Instance->VVSACR |= VidCfg->VerticalSyncActive;

        /* Set the Vertical Back Porch (VBP)*/
        hdsi->Instance->VVBPCR &= ~DSI_VVBPCR_VBP;
        hdsi->Instance->VVBPCR |= VidCfg->VerticalBackPorch;

        /* Set the Vertical Front Porch (VFP)*/
        hdsi->Instance->VVFPCR &= ~DSI_VVFPCR_VFP;
        hdsi->Instance->VVFPCR |= VidCfg->VerticalFrontPorch;

        /* Set the Vertical Active period*/
        hdsi->Instance->VVACR &= ~DSI_VVACR_VA;
        hdsi->Instance->VVACR |= VidCfg->VerticalActive;

        /* Configure the command transmission mode */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPCE;
        hdsi->Instance->VMCR |= VidCfg->LPCommandEnable;

        /* Low power largest packet size */
        hdsi->Instance->LPMCR &= ~DSI_LPMCR_LPSIZE;
        hdsi->Instance->LPMCR |= ((VidCfg->LPLargestPacketSize) << 16U);

        /* Low power VACT largest packet size */
        hdsi->Instance->LPMCR &= ~DSI_LPMCR_VLPSIZE;
        hdsi->Instance->LPMCR |= VidCfg->LPVACTLargestPacketSize;

        /* Enable LP transition in HFP period */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPHFPE;
        hdsi->Instance->VMCR |= VidCfg->LPHorizontalFrontPorchEnable;

        /* Enable LP transition in HBP period */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPHBPE;
        hdsi->Instance->VMCR |= VidCfg->LPHorizontalBackPorchEnable;

        /* Enable LP transition in VACT period */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPVAE;
        hdsi->Instance->VMCR |= VidCfg->LPVerticalActiveEnable;

        /* Enable LP transition in VFP period */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPVFPE;
        hdsi->Instance->VMCR |= VidCfg->LPVerticalFrontPorchEnable;

        /* Enable LP transition in VBP period */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPVBPE;
        hdsi->Instance->VMCR |= VidCfg->LPVerticalBackPorchEnable;

        /* Enable LP transition in vertical sync period */
        hdsi->Instance->VMCR &= ~DSI_VMCR_LPVSAE;
        hdsi->Instance->VMCR |= VidCfg->LPVerticalSyncActiveEnable;

        /* Enable the request for an acknowledge response at the end of a frame */
        hdsi->Instance->VMCR &= ~DSI_VMCR_FBTAAE;
        hdsi->Instance->VMCR |= VidCfg->FrameBTAAcknowledgeEnable;

        /* Process unlocked */
        __HAL_UNLOCK(hdsi);

        return HAL_OK;
    }

    void HAL_DSI_MspInit()
    {
        /* Prevent unused argument(s) compilation warning */
        //UNUSED(hdsi);
        /* NOTE : This function Should not be modified, when the callback is needed,
                  the HAL_DSI_MspInit could be implemented in the user file
         */
    }

    void HAL_NVIC_DisableIRQ(IRQn_Type IRQn)
    {
        /* Check the parameters */
        assert_param(IS_NVIC_DEVICE_IRQ(IRQn));

        /* Disable interrupt */
        NVIC_DisableIRQ(IRQn);
    }

    void BSP_LCD_MspDeInit(void)
    {
        /** @brief Disable IRQ of LTDC IP */
        HAL_NVIC_DisableIRQ(LTDC_IRQn);

        /** @brief Disable IRQ of DMA2D IP */
        HAL_NVIC_DisableIRQ(DMA2D_IRQn);

        /** @brief Disable IRQ of DSI IP */
        HAL_NVIC_DisableIRQ(DSI_IRQn);


        /** @brief Force and let in reset state LTDC, DMA2D and DSI Host + Wrapper IPs */
        __HAL_RCC_LTDC_FORCE_RESET();
        __HAL_RCC_DMA2D_FORCE_RESET();
        __HAL_RCC_DSI_FORCE_RESET();

        /** @brief Disable the LTDC, DMA2D and DSI Host and Wrapper clocks */
        __HAL_RCC_LTDC_CLK_DISABLE();
        __HAL_RCC_DMA2D_CLK_DISABLE();
        __HAL_RCC_DSI_CLK_DISABLE();
    }

    HAL_StatusTypeDef HAL_DSI_Init(DSI_HandleTypeDef* hdsi, DSI_PLLInitTypeDef* PLLInit)
    {
        uint32_t tickstart;
        uint32_t unitIntervalx4;
        uint32_t tempIDF;

        /* Check the DSI handle allocation */
        if (hdsi == NULL)
        {
            return HAL_ERROR;
        }

        /* Check function parameters */
        assert_param(IS_DSI_PLL_NDIV(PLLInit->PLLNDIV));
        assert_param(IS_DSI_PLL_IDF(PLLInit->PLLIDF));
        assert_param(IS_DSI_PLL_ODF(PLLInit->PLLODF));
        assert_param(IS_DSI_AUTO_CLKLANE_CONTROL(hdsi->Init.AutomaticClockLaneControl));
        assert_param(IS_DSI_NUMBER_OF_LANES(hdsi->Init.NumberOfLanes));

        //#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
        //    if (hdsi->State == HAL_DSI_STATE_RESET)
        //    {
        //        /* Reset the DSI callback to the legacy weak callbacks */
        //        hdsi->TearingEffectCallback = HAL_DSI_TearingEffectCallback; /* Legacy weak TearingEffectCallback */
        //        hdsi->EndOfRefreshCallback = HAL_DSI_EndOfRefreshCallback;  /* Legacy weak EndOfRefreshCallback  */
        //        hdsi->ErrorCallback = HAL_DSI_ErrorCallback;         /* Legacy weak ErrorCallback         */
        //
        //        if (hdsi->MspInitCallback == NULL)
        //        {
        //            hdsi->MspInitCallback = HAL_DSI_MspInit;
        //        }
        //        /* Initialize the low level hardware */
        //        hdsi->MspInitCallback(hdsi);
        //    }
        //#else
        if (hdsi->State == HAL_DSI_STATE_RESET)
        {
            /* Initialize the low level hardware */
            HAL_DSI_MspInit();
        }
        //#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */

