nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
            /* Change DSI peripheral state */
        hdsi->State = HAL_DSI_STATE_BUSY;

        /**************** Turn on the regulator and enable the DSI PLL ****************/

        /* Enable the regulator */
        __HAL_DSI_REG_ENABLE(hdsi);

        /* Get tick */
        tickstart = HAL_GetTick();

        /* Wait until the regulator is ready */
        while (__HAL_DSI_GET_FLAG(hdsi, DSI_FLAG_RRS) == 0U)
        {
            /* Check for the Timeout */
            if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
            {
                return HAL_TIMEOUT;
            }
        }

        /* Set the PLL division factors */
        hdsi->Instance->WRPCR &= ~(DSI_WRPCR_PLL_NDIV | DSI_WRPCR_PLL_IDF | DSI_WRPCR_PLL_ODF);
        hdsi->Instance->WRPCR |= (((PLLInit->PLLNDIV) << 2U) | ((PLLInit->PLLIDF) << 11U) | ((PLLInit->PLLODF) << 16U));

        /* Enable the DSI PLL */
        __HAL_DSI_PLL_ENABLE(hdsi);

        /* Get tick */
        tickstart = HAL_GetTick();

        /* Wait for the lock of the PLL */
        while (__HAL_DSI_GET_FLAG(hdsi, DSI_FLAG_PLLLS) == 0U)
        {
            /* Check for the Timeout */
            if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
            {
                return HAL_TIMEOUT;
            }
        }

        /*************************** Set the PHY parameters ***************************/

        /* D-PHY clock and digital enable*/
        hdsi->Instance->PCTLR |= (DSI_PCTLR_CKE | DSI_PCTLR_DEN);

        /* Clock lane configuration */
        hdsi->Instance->CLCR &= ~(DSI_CLCR_DPCC | DSI_CLCR_ACR);
        hdsi->Instance->CLCR |= (DSI_CLCR_DPCC | hdsi->Init.AutomaticClockLaneControl);

        /* Configure the number of active data lanes */
        hdsi->Instance->PCONFR &= ~DSI_PCONFR_NL;
        hdsi->Instance->PCONFR |= hdsi->Init.NumberOfLanes;

        /************************ Set the DSI clock parameters ************************/

        /* Set the TX escape clock division factor */
        hdsi->Instance->CCR &= ~DSI_CCR_TXECKDIV;
        hdsi->Instance->CCR |= hdsi->Init.TXEscapeCkdiv;

        /* Calculate the bit period in high-speed mode in unit of 0.25 ns (UIX4) */
        /* The equation is : UIX4 = IntegerPart( (1000/F_PHY_Mhz) * 4 )          */
        /* Where : F_PHY_Mhz = (NDIV * HSE_Mhz) / (IDF * ODF)                    */
        tempIDF = (PLLInit->PLLIDF > 0U) ? PLLInit->PLLIDF : 1U;
        unitIntervalx4 = (4000000U * tempIDF * ((1UL << (0x3U & PLLInit->PLLODF)))) / ((HSE_VALUE / 1000U) * PLLInit->PLLNDIV);

        /* Set the bit period in high-speed mode */
        hdsi->Instance->WPCR[0U] &= ~DSI_WPCR0_UIX4;
        hdsi->Instance->WPCR[0U] |= unitIntervalx4;

        /****************************** Error management *****************************/

        /* Disable all error interrupts and reset the Error Mask */
        hdsi->Instance->IER[0U] = 0U;
        hdsi->Instance->IER[1U] = 0U;
        hdsi->ErrorMsk = 0U;

        /* Initialise the error code */
        hdsi->ErrorCode = HAL_DSI_ERROR_NONE;

        /* Initialize the DSI state*/
        hdsi->State = HAL_DSI_STATE_READY;

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_LTDCEx_StructInitFromVideoConfig(LTDC_HandleTypeDef* hltdc, DSI_VidCfgTypeDef* VidCfg)
    {
        /* Retrieve signal polarities from DSI */

        /* The following polarity is inverted:
                           LTDC_DEPOLARITY_AL <-> LTDC_DEPOLARITY_AH */

                           /* Note 1 : Code in line w/ Current LTDC specification */
        hltdc->Init.DEPolarity = (VidCfg->DEPolarity == DSI_DATA_ENABLE_ACTIVE_HIGH) ? LTDC_DEPOLARITY_AL : LTDC_DEPOLARITY_AH;
        hltdc->Init.VSPolarity = (VidCfg->VSPolarity == DSI_VSYNC_ACTIVE_HIGH) ? LTDC_VSPOLARITY_AH : LTDC_VSPOLARITY_AL;
        hltdc->Init.HSPolarity = (VidCfg->HSPolarity == DSI_HSYNC_ACTIVE_HIGH) ? LTDC_HSPOLARITY_AH : LTDC_HSPOLARITY_AL;

        /* Note 2: Code to be used in case LTDC polarities inversion updated in the specification */
        /* hltdc->Init.DEPolarity = VidCfg->DEPolarity << 29;
           hltdc->Init.VSPolarity = VidCfg->VSPolarity << 29;
           hltdc->Init.HSPolarity = VidCfg->HSPolarity << 29; */

           /* Retrieve vertical timing parameters from DSI */
        hltdc->Init.VerticalSync = VidCfg->VerticalSyncActive - 1U;
        hltdc->Init.AccumulatedVBP = VidCfg->VerticalSyncActive + VidCfg->VerticalBackPorch - 1U;
        hltdc->Init.AccumulatedActiveH = VidCfg->VerticalSyncActive + VidCfg->VerticalBackPorch + VidCfg->VerticalActive - 1U;
        hltdc->Init.TotalHeigh = VidCfg->VerticalSyncActive + VidCfg->VerticalBackPorch + VidCfg->VerticalActive + VidCfg->VerticalFrontPorch - 1U;

        return HAL_OK;
    }

//______________________________________________________________________
// Touch
//___________________________________________________________________

    void ft6x06_Init(uint16_t DeviceAddr)
    {
        uint8_t instance;
        uint8_t empty;

        /* Check if device instance already exists */
        instance = ft6x06_GetInstance(DeviceAddr);

        /* To prevent double initialization */
        if (instance == 0xFF)
        {
            /* Look for empty instance */
            empty = ft6x06_GetInstance(0);

            if (empty < FT6x06_MAX_INSTANCE)
            {
                /* Register the current device instance */
                ft6x06[empty] = DeviceAddr;

                /* Initialize IO BUS layer */
                TS_IO_Init();
            }
        }
    }

    uint8_t ft6x06_GetInstance(uint16_t DeviceAddr)
    {
        uint8_t idx = 0;

        /* Check all the registered instances */
        for (idx = 0; idx < FT6x06_MAX_INSTANCE; idx++)
        {
            if (ft6x06[idx] == DeviceAddr)
            {
                return idx;
            }
        }

        return 0xFF;
    }

    void ft6x06_Reset(uint16_t DeviceAddr)
    {
        UNUSED(DeviceAddr);
        /* Do nothing */
        /* No software reset sequence available in FT6206 IC */
    }

    void TS_IO_Init(void)
    {
        I2Cx_Init(&hI2cAudioHandler);
    }

    uint16_t ft6x06_ReadID(uint16_t DeviceAddr)
    {
        /* Initialize I2C link if needed */
        TS_IO_Init();

