nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        /* Return the device ID value */
        return (TS_IO_Read(DeviceAddr, FT6206_CHIP_ID_REG));
    }

    static uint32_t ft6x06_TS_Configure(uint16_t DeviceAddr)
    {
        uint32_t status = FT6206_STATUS_OK;
        UNUSED(DeviceAddr);

        /* Nothing special to be done for FT6206 */

        return(status);
    }

    void ft6x06_TS_Start(uint16_t DeviceAddr)
    {
#if (TS_AUTO_CALIBRATION_SUPPORTED == 1)
        /* Hw Calibration sequence start : should be done once after each power up */
        /* This is called internal calibration of the touch screen                 */
        ft6x06_TS_Calibration(DeviceAddr);
#endif
        /* Minimum static configuration of FT6206 */
        ft6x06_TS_Configure(DeviceAddr);

        /* By default set FT6206 IC in Polling mode : no INT generation on FT6206 for new touch available */
        /* Note TS_INT is active low                                                                      */
        ft6x06_TS_DisableIT(DeviceAddr);
    }

    uint8_t TS_IO_Read(uint8_t Addr, uint8_t Reg)
    {
        uint8_t read_value = 0;

        I2Cx_ReadMultiple(&hI2cAudioHandler, Addr, Reg, I2C_MEMADD_SIZE_8BIT, (uint8_t*)&read_value, 1);

        return read_value;
    }

    uint8_t ft6x06_TS_DetectTouch(uint16_t DeviceAddr)
    {
        volatile uint8_t nbTouch = 0;

        /* Read register FT6206_TD_STAT_REG to check number of touches detection */
        nbTouch = TS_IO_Read(DeviceAddr, FT6206_TD_STAT_REG);
        nbTouch &= FT6206_TD_STAT_MASK;

        if (nbTouch > FT6206_MAX_DETECTABLE_TOUCH)
        {
            /* If invalid number of touch detected, set it to zero */
            nbTouch = 0;
        }

        /* Update ft6x06 driver internal global : current number of active touches */
        ft6x06_handle.currActiveTouchNb = nbTouch;

        /* Reset current active touch index on which to work on */
        ft6x06_handle.currActiveTouchIdx = 0;

        return(nbTouch);
    }

    void ft6x06_TS_GetXY(uint16_t DeviceAddr, uint16_t* X, uint16_t* Y)
    {
        uint8_t regAddress = 0;
        uint8_t  dataxy[4];

        if (ft6x06_handle.currActiveTouchIdx < ft6x06_handle.currActiveTouchNb)
        {
            switch (ft6x06_handle.currActiveTouchIdx)
            {
            case 0:
                regAddress = FT6206_P1_XH_REG;
                break;
            case 1:
                regAddress = FT6206_P2_XH_REG;
                break;

            default:
                break;
            }

            /* Read X and Y positions */
            TS_IO_ReadMultiple(DeviceAddr, regAddress, dataxy, sizeof(dataxy));

            /* Send back ready X position to caller */
            *X = ((dataxy[0] & FT6206_MSB_MASK) << 8) | (dataxy[1] & FT6206_LSB_MASK);

            /* Send back ready Y position to caller */
            *Y = ((dataxy[2] & FT6206_MSB_MASK) << 8) | (dataxy[3] & FT6206_LSB_MASK);

            ft6x06_handle.currActiveTouchIdx++;
        }
    }

    static HAL_StatusTypeDef I2C_WaitOnFlagUntilTimeout(I2C_HandleTypeDef* hi2c, uint32_t Flag, FlagStatus Status, uint32_t Timeout, uint32_t Tickstart)
    {
        while (__HAL_I2C_GET_FLAG(hi2c, Flag) == Status)
        {
            /* Check for the Timeout */
            if (Timeout != HAL_MAX_DELAY)
            {
                if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
                {
                    hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
                    hi2c->State = HAL_I2C_STATE_READY;
                    hi2c->Mode = HAL_I2C_MODE_NONE;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hi2c);
                    return HAL_ERROR;
                }
            }
        }
        return HAL_OK;
    }


    static void I2C_TransferConfig(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint8_t Size, uint32_t Mode, uint32_t Request)
    {
        /* Check the parameters */
        assert_param(IS_I2C_ALL_INSTANCE(hi2c->Instance));
        assert_param(IS_TRANSFER_MODE(Mode));
        assert_param(IS_TRANSFER_REQUEST(Request));

        /* update CR2 register */
        MODIFY_REG(hi2c->Instance->CR2, ((I2C_CR2_SADD | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_AUTOEND | (I2C_CR2_RD_WRN & (uint32_t)(Request >> (31U - I2C_CR2_RD_WRN_Pos))) | I2C_CR2_START | I2C_CR2_STOP)), \
            (uint32_t)(((uint32_t)DevAddress & I2C_CR2_SADD) | (((uint32_t)Size << I2C_CR2_NBYTES_Pos) & I2C_CR2_NBYTES) | (uint32_t)Mode | (uint32_t)Request));
    }

    static HAL_StatusTypeDef I2C_WaitOnTXISFlagUntilTimeout(I2C_HandleTypeDef* hi2c, uint32_t Timeout, uint32_t Tickstart)
    {
        while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXIS) == RESET)
        {
            /* Check if a NACK is detected */
            if (I2C_IsAcknowledgeFailed(hi2c, Timeout, Tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Check for the Timeout */
            if (Timeout != HAL_MAX_DELAY)
            {
                if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
                {
                    hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
                    hi2c->State = HAL_I2C_STATE_READY;
                    hi2c->Mode = HAL_I2C_MODE_NONE;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hi2c);

                    return HAL_ERROR;
                }
            }
        }
        return HAL_OK;
    }

    static HAL_StatusTypeDef I2C_RequestMemoryWrite(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint32_t Timeout, uint32_t Tickstart)
    {
        I2C_TransferConfig(hi2c, DevAddress, (uint8_t)MemAddSize, I2C_RELOAD_MODE, I2C_GENERATE_START_WRITE);

        /* Wait until TXIS flag is set */
        if (I2C_WaitOnTXISFlagUntilTimeout(hi2c, Timeout, Tickstart) != HAL_OK)
        {
            return HAL_ERROR;
        }

        /* If Memory address size is 8Bit */
        if (MemAddSize == I2C_MEMADD_SIZE_8BIT)
        {
            /* Send Memory Address */
            hi2c->Instance->TXDR = I2C_MEM_ADD_LSB(MemAddress);
        }
        /* If Memory address size is 16Bit */
        else
        {
            /* Send MSB of Memory Address */
            hi2c->Instance->TXDR = I2C_MEM_ADD_MSB(MemAddress);

            /* Wait until TXIS flag is set */
            if (I2C_WaitOnTXISFlagUntilTimeout(hi2c, Timeout, Tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Send LSB of Memory Address */
            hi2c->Instance->TXDR = I2C_MEM_ADD_LSB(MemAddress);
        }

        /* Wait until TCR flag is set */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TCR, RESET, Timeout, Tickstart) != HAL_OK)
        {
            return HAL_ERROR;
        }

        return HAL_OK;
    }


    HAL_StatusTypeDef HAL_I2C_Mem_Write(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t* pData, uint16_t Size, uint32_t Timeout)
    {
        uint32_t tickstart;

        /* Check the parameters */
        assert_param(IS_I2C_MEMADD_SIZE(MemAddSize));

        if (hi2c->State == HAL_I2C_STATE_READY)
        {
            if ((pData == NULL) || (Size == 0U))
            {
                hi2c->ErrorCode = HAL_I2C_ERROR_INVALID_PARAM;
                return  HAL_ERROR;
            }

            /* Process Locked */
            __HAL_LOCK(hi2c);

            /* Init tickstart for timeout management*/
            tickstart = HAL_GetTick();

            if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY, tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

