nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
            hi2c->State = HAL_I2C_STATE_BUSY_TX;
            hi2c->Mode = HAL_I2C_MODE_MEM;
            hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

            /* Prepare transfer parameters */
            hi2c->pBuffPtr = pData;
            hi2c->XferCount = Size;
            hi2c->XferISR = NULL;

            /* Send Slave Address and Memory Address */
            if (I2C_RequestMemoryWrite(hi2c, DevAddress, MemAddress, MemAddSize, Timeout, tickstart) != HAL_OK)
            {
                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);
                return HAL_ERROR;
            }

            /* Set NBYTES to write and reload if hi2c->XferCount > MAX_NBYTE_SIZE */
            if (hi2c->XferCount > MAX_NBYTE_SIZE)
            {
                hi2c->XferSize = MAX_NBYTE_SIZE;
                I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
            }
            else
            {
                hi2c->XferSize = hi2c->XferCount;
                I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
            }

            do
            {
                /* Wait until TXIS flag is set */
                if (I2C_WaitOnTXISFlagUntilTimeout(hi2c, Timeout, tickstart) != HAL_OK)
                {
                    return HAL_ERROR;
                }

                /* Write data to TXDR */
                hi2c->Instance->TXDR = *hi2c->pBuffPtr;

                /* Increment Buffer pointer */
                hi2c->pBuffPtr++;

                hi2c->XferCount--;
                hi2c->XferSize--;

                if ((hi2c->XferCount != 0U) && (hi2c->XferSize == 0U))
                {
                    /* Wait until TCR flag is set */
                    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TCR, RESET, Timeout, tickstart) != HAL_OK)
                    {
                        return HAL_ERROR;
                    }

                    if (hi2c->XferCount > MAX_NBYTE_SIZE)
                    {
                        hi2c->XferSize = MAX_NBYTE_SIZE;
                        I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
                    }
                    else
                    {
                        hi2c->XferSize = hi2c->XferCount;
                        I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
                    }
                }

            } while (hi2c->XferCount > 0U);

            /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
            /* Wait until STOPF flag is reset */
            if (I2C_WaitOnSTOPFlagUntilTimeout(hi2c, Timeout, tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Clear STOP Flag */
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

            /* Clear Configuration Register 2 */
            I2C_RESET_CR2(hi2c);

            hi2c->State = HAL_I2C_STATE_READY;
            hi2c->Mode = HAL_I2C_MODE_NONE;

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            return HAL_OK;
        }
        else
        {
            return HAL_BUSY;
        }
    }
    

    void HAL_GPIO_Init(GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init)
    {
        uint32_t position = 0x00;
        uint32_t ioposition = 0x00;
        uint32_t iocurrent = 0x00;
        uint32_t temp = 0x00;

        /* Check the parameters */
        assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
        assert_param(IS_GPIO_PIN(GPIO_Init->Pin));
        assert_param(IS_GPIO_MODE(GPIO_Init->Mode));
        assert_param(IS_GPIO_PULL(GPIO_Init->Pull));

        /* Configure the port pins */
        for (position = 0; position < GPIO_NUMBER; position++)
        {
            /* Get the IO position */
            ioposition = ((uint32_t)0x01) << position;
            /* Get the current IO position */
            iocurrent = (uint32_t)(GPIO_Init->Pin) & ioposition;

            if (iocurrent == ioposition)
            {
                /*--------------------- GPIO Mode Configuration ------------------------*/
                /* In case of Alternate function mode selection */
                if ((GPIO_Init->Mode == GPIO_MODE_AF_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
                {
                    /* Check the Alternate function parameter */
                    assert_param(IS_GPIO_AF(GPIO_Init->Alternate));

                    /* Configure Alternate function mapped with the current IO */
                    temp = GPIOx->AFR[position >> 3];
                    temp &= ~((uint32_t)0xF << ((uint32_t)(position & (uint32_t)0x07) * 4));
                    temp |= ((uint32_t)(GPIO_Init->Alternate) << (((uint32_t)position & (uint32_t)0x07) * 4));
                    GPIOx->AFR[position >> 3] = temp;
                }

                /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
                temp = GPIOx->MODER;
                temp &= ~(GPIO_MODER_MODER0 << (position * 2));
                temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * 2));
                GPIOx->MODER = temp;

                /* In case of Output or Alternate function mode selection */
                if ((GPIO_Init->Mode == GPIO_MODE_OUTPUT_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_PP) ||
                    (GPIO_Init->Mode == GPIO_MODE_OUTPUT_OD) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
                {
                    /* Check the Speed parameter */
                    assert_param(IS_GPIO_SPEED(GPIO_Init->Speed));
                    /* Configure the IO Speed */
                    temp = GPIOx->OSPEEDR;
                    temp &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2));
                    temp |= (GPIO_Init->Speed << (position * 2));
                    GPIOx->OSPEEDR = temp;

                    /* Configure the IO Output Type */
                    temp = GPIOx->OTYPER;
                    temp &= ~(GPIO_OTYPER_OT_0 << position);
                    temp |= (((GPIO_Init->Mode & GPIO_OUTPUT_TYPE) >> 4) << position);
                    GPIOx->OTYPER = temp;
                }

                /* Activate the Pull-up or Pull down resistor for the current IO */
                temp = GPIOx->PUPDR;
                temp &= ~(GPIO_PUPDR_PUPDR0 << (position * 2));
                temp |= ((GPIO_Init->Pull) << (position * 2));
                GPIOx->PUPDR = temp;

                /*--------------------- EXTI Mode Configuration ------------------------*/
                /* Configure the External Interrupt or event for the current IO */
                if ((GPIO_Init->Mode & EXTI_MODE) == EXTI_MODE)
                {
                    /* Enable SYSCFG Clock */
                    __HAL_RCC_SYSCFG_CLK_ENABLE();

                    temp = SYSCFG->EXTICR[position >> 2];
                    temp &= ~(((uint32_t)0x0F) << (4 * (position & 0x03)));
                    temp |= ((uint32_t)(GPIO_GET_INDEX(GPIOx)) << (4 * (position & 0x03)));
                    SYSCFG->EXTICR[position >> 2] = temp;

