nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
                    /* Clear EXTI line configuration */
                    temp = EXTI->IMR;
                    temp &= ~((uint32_t)iocurrent);
                    if ((GPIO_Init->Mode & GPIO_MODE_IT) == GPIO_MODE_IT)
                    {
                        temp |= iocurrent;
                    }
                    EXTI->IMR = temp;

                    temp = EXTI->EMR;
                    temp &= ~((uint32_t)iocurrent);
                    if ((GPIO_Init->Mode & GPIO_MODE_EVT) == GPIO_MODE_EVT)
                    {
                        temp |= iocurrent;
                    }
                    EXTI->EMR = temp;

                    /* Clear Rising Falling edge configuration */
                    temp = EXTI->RTSR;
                    temp &= ~((uint32_t)iocurrent);
                    if ((GPIO_Init->Mode & RISING_EDGE) == RISING_EDGE)
                    {
                        temp |= iocurrent;
                    }
                    EXTI->RTSR = temp;

                    temp = EXTI->FTSR;
                    temp &= ~((uint32_t)iocurrent);
                    if ((GPIO_Init->Mode & FALLING_EDGE) == FALLING_EDGE)
                    {
                        temp |= iocurrent;
                    }
                    EXTI->FTSR = temp;
                }
            }
        }
    }

    void HAL_NVIC_EnableIRQ(IRQn_Type IRQn)
    {
        /* Check the parameters */
        assert_param(IS_NVIC_DEVICE_IRQ(IRQn));

        /* Enable interrupt */
        NVIC_EnableIRQ(IRQn);
    }

    static void I2Cx_MspInit(I2C_HandleTypeDef* i2c_handler)
    {
        GPIO_InitTypeDef  gpio_init_structure;

        if (i2c_handler == (I2C_HandleTypeDef*)(&hI2cAudioHandler))
        {
            /*** Configure the GPIOs ***/
            /* Enable GPIO clock */
            DISCOVERY_AUDIO_I2Cx_SCL_GPIO_CLK_ENABLE();
            DISCOVERY_AUDIO_I2Cx_SDA_GPIO_CLK_ENABLE();
            /* Configure I2C Tx as alternate function */
            gpio_init_structure.Pin = DISCOVERY_AUDIO_I2Cx_SCL_PIN;
            gpio_init_structure.Mode = GPIO_MODE_AF_OD;
            gpio_init_structure.Pull = GPIO_NOPULL;
            gpio_init_structure.Speed = GPIO_SPEED_FAST;
            gpio_init_structure.Alternate = DISCOVERY_AUDIO_I2Cx_SCL_AF;
            HAL_GPIO_Init(DISCOVERY_AUDIO_I2Cx_SCL_GPIO_PORT, &gpio_init_structure);

            /* Configure I2C Rx as alternate function */
            gpio_init_structure.Pin = DISCOVERY_AUDIO_I2Cx_SDA_PIN;
            gpio_init_structure.Alternate = DISCOVERY_AUDIO_I2Cx_SDA_AF;
            HAL_GPIO_Init(DISCOVERY_AUDIO_I2Cx_SDA_GPIO_PORT, &gpio_init_structure);

            /*** Configure the I2C peripheral ***/
            /* Enable I2C clock */
            DISCOVERY_AUDIO_I2Cx_CLK_ENABLE();

            /* Force the I2C peripheral clock reset */
            DISCOVERY_AUDIO_I2Cx_FORCE_RESET();

            /* Release the I2C peripheral clock reset */
            DISCOVERY_AUDIO_I2Cx_RELEASE_RESET();

            /* Enable and set I2C1 Interrupt to a lower priority */
            HAL_NVIC_SetPriority(DISCOVERY_AUDIO_I2Cx_EV_IRQn, 0x0F, 0);
            HAL_NVIC_EnableIRQ(DISCOVERY_AUDIO_I2Cx_EV_IRQn);

            /* Enable and set I2C1 Interrupt to a lower priority */
            HAL_NVIC_SetPriority(DISCOVERY_AUDIO_I2Cx_ER_IRQn, 0x0F, 0);
            HAL_NVIC_EnableIRQ(DISCOVERY_AUDIO_I2Cx_ER_IRQn);

        }
        else
        {
            /*** Configure the GPIOs ***/
            /* Enable GPIO clock */
            DISCOVERY_EXT_I2Cx_SCL_SDA_GPIO_CLK_ENABLE();

            /* Configure I2C Tx as alternate function */
            gpio_init_structure.Pin = DISCOVERY_EXT_I2Cx_SCL_PIN;
            gpio_init_structure.Mode = GPIO_MODE_AF_OD;
            gpio_init_structure.Pull = GPIO_NOPULL;
            gpio_init_structure.Speed = GPIO_SPEED_FAST;
            gpio_init_structure.Alternate = DISCOVERY_EXT_I2Cx_SCL_SDA_AF;
            HAL_GPIO_Init(DISCOVERY_EXT_I2Cx_SCL_SDA_GPIO_PORT, &gpio_init_structure);

            /* Configure I2C Rx as alternate function */
            gpio_init_structure.Pin = DISCOVERY_EXT_I2Cx_SDA_PIN;
            HAL_GPIO_Init(DISCOVERY_EXT_I2Cx_SCL_SDA_GPIO_PORT, &gpio_init_structure);

            /*** Configure the I2C peripheral ***/
            /* Enable I2C clock */
            DISCOVERY_EXT_I2Cx_CLK_ENABLE();

            /* Force the I2C peripheral clock reset */
            DISCOVERY_EXT_I2Cx_FORCE_RESET();

            /* Release the I2C peripheral clock reset */
            DISCOVERY_EXT_I2Cx_RELEASE_RESET();

            /* Enable and set I2C1 Interrupt to a lower priority */
            HAL_NVIC_SetPriority(DISCOVERY_EXT_I2Cx_EV_IRQn, 0x0F, 0);
            HAL_NVIC_EnableIRQ(DISCOVERY_EXT_I2Cx_EV_IRQn);

            /* Enable and set I2C1 Interrupt to a lower priority */
            HAL_NVIC_SetPriority(DISCOVERY_EXT_I2Cx_ER_IRQn, 0x0F, 0);
            HAL_NVIC_EnableIRQ(DISCOVERY_EXT_I2Cx_ER_IRQn);
        }
    }
    
    void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c)
    {
        /* Prevent unused argument(s) compilation warning */
        UNUSED(hi2c);

        /* NOTE : This function should not be modified, when the callback is needed,
                  the HAL_I2C_MspInit could be implemented in the user file
         */
    }


    HAL_StatusTypeDef HAL_I2C_Init(I2C_HandleTypeDef* hi2c)
    {
        /* Check the I2C handle allocation */
        if (hi2c == NULL)
        {
            return HAL_ERROR;
        }
  
        /* Check the parameters */
        assert_param(IS_I2C_ALL_INSTANCE(hi2c->Instance));
        assert_param(IS_I2C_OWN_ADDRESS1(hi2c->Init.OwnAddress1));
        assert_param(IS_I2C_ADDRESSING_MODE(hi2c->Init.AddressingMode));
        assert_param(IS_I2C_DUAL_ADDRESS(hi2c->Init.DualAddressMode));
        assert_param(IS_I2C_OWN_ADDRESS2(hi2c->Init.OwnAddress2));
        assert_param(IS_I2C_OWN_ADDRESS2_MASK(hi2c->Init.OwnAddress2Masks));
        assert_param(IS_I2C_GENERAL_CALL(hi2c->Init.GeneralCallMode));
        assert_param(IS_I2C_NO_STRETCH(hi2c->Init.NoStretchMode));

        if (hi2c->State == HAL_I2C_STATE_RESET)
        {
            /* Allocate lock resource and initialize it */
            hi2c->Lock = HAL_UNLOCKED;

