nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
////////////#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
////////////            /* Init the I2C Callback settings */
////////////            hi2c->MasterTxCpltCallback = HAL_I2C_MasterTxCpltCallback; /* Legacy weak MasterTxCpltCallback */
////////////            hi2c->MasterRxCpltCallback = HAL_I2C_MasterRxCpltCallback; /* Legacy weak MasterRxCpltCallback */
////////////            hi2c->SlaveTxCpltCallback = HAL_I2C_SlaveTxCpltCallback;  /* Legacy weak SlaveTxCpltCallback  */
////////////            hi2c->SlaveRxCpltCallback = HAL_I2C_SlaveRxCpltCallback;  /* Legacy weak SlaveRxCpltCallback  */
////////////            hi2c->ListenCpltCallback = HAL_I2C_ListenCpltCallback;   /* Legacy weak ListenCpltCallback   */
////////////            hi2c->MemTxCpltCallback = HAL_I2C_MemTxCpltCallback;    /* Legacy weak MemTxCpltCallback    */
////////////            hi2c->MemRxCpltCallback = HAL_I2C_MemRxCpltCallback;    /* Legacy weak MemRxCpltCallback    */
////////////            hi2c->ErrorCallback = HAL_I2C_ErrorCallback;        /* Legacy weak ErrorCallback        */
////////////            hi2c->AbortCpltCallback = HAL_I2C_AbortCpltCallback;    /* Legacy weak AbortCpltCallback    */
////////////            hi2c->AddrCallback = HAL_I2C_AddrCallback;         /* Legacy weak AddrCallback         */
////////////
////////////            if (hi2c->MspInitCallback == NULL)
////////////            {
////////////                hi2c->MspInitCallback = HAL_I2C_MspInit; /* Legacy weak MspInit  */
////////////            }
////////////
////////////            /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
////////////            hi2c->MspInitCallback(hi2c);
////////////#else
            /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
            HAL_I2C_MspInit(hi2c);
////////////#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */
        }

        hi2c->State = HAL_I2C_STATE_BUSY;

        /* Disable the selected I2C peripheral */
        __HAL_I2C_DISABLE(hi2c);

        /*---------------------------- I2Cx TIMINGR Configuration ------------------*/
        /* Configure I2Cx: Frequency range */
        hi2c->Instance->TIMINGR = hi2c->Init.Timing & TIMING_CLEAR_MASK;

        /*---------------------------- I2Cx OAR1 Configuration ---------------------*/
        /* Disable Own Address1 before set the Own Address1 configuration */
        hi2c->Instance->OAR1 &= ~I2C_OAR1_OA1EN;

        /* Configure I2Cx: Own Address1 and ack own address1 mode */
        if (hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_7BIT)
        {
            hi2c->Instance->OAR1 = (I2C_OAR1_OA1EN | hi2c->Init.OwnAddress1);
        }
        else /* I2C_ADDRESSINGMODE_10BIT */
        {
            hi2c->Instance->OAR1 = (I2C_OAR1_OA1EN | I2C_OAR1_OA1MODE | hi2c->Init.OwnAddress1);
        }

        /*---------------------------- I2Cx CR2 Configuration ----------------------*/
        /* Configure I2Cx: Addressing Master mode */
        if (hi2c->Init.AddressingMode == I2C_ADDRESSINGMODE_10BIT)
        {
            hi2c->Instance->CR2 = (I2C_CR2_ADD10);
        }
        /* Enable the AUTOEND by default, and enable NACK (should be disable only during Slave process */
        hi2c->Instance->CR2 |= (I2C_CR2_AUTOEND | I2C_CR2_NACK);

        /*---------------------------- I2Cx OAR2 Configuration ---------------------*/
        /* Disable Own Address2 before set the Own Address2 configuration */
        hi2c->Instance->OAR2 &= ~I2C_DUALADDRESS_ENABLE;

        /* Configure I2Cx: Dual mode and Own Address2 */
        hi2c->Instance->OAR2 = (hi2c->Init.DualAddressMode | hi2c->Init.OwnAddress2 | (hi2c->Init.OwnAddress2Masks << 8));

        /*---------------------------- I2Cx CR1 Configuration ----------------------*/
        /* Configure I2Cx: Generalcall and NoStretch mode */
        hi2c->Instance->CR1 = (hi2c->Init.GeneralCallMode | hi2c->Init.NoStretchMode);

        /* Enable the selected I2C peripheral */
        __HAL_I2C_ENABLE(hi2c);

        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
        hi2c->State = HAL_I2C_STATE_READY;
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        return HAL_OK;
    }

    HAL_I2C_StateTypeDef HAL_I2C_GetState(I2C_HandleTypeDef* hi2c)
    {
        /* Return I2C handle state */
        return hi2c->State;
    }

    static void I2Cx_Init(I2C_HandleTypeDef* i2c_handler)
    {
        if (HAL_I2C_GetState(i2c_handler) == HAL_I2C_STATE_RESET)
        {
            if (i2c_handler == (I2C_HandleTypeDef*)(&hI2cAudioHandler))
            {
                /* Audio and LCD I2C configuration */
                i2c_handler->Instance = DISCOVERY_AUDIO_I2Cx;
            }
            else
            {
                /* External, camera and Arduino connector  I2C configuration */
                i2c_handler->Instance = DISCOVERY_EXT_I2Cx;
            }
            i2c_handler->Init.Timing = DISCOVERY_I2Cx_TIMING;
            i2c_handler->Init.OwnAddress1 = 0;
            i2c_handler->Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
            i2c_handler->Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
            i2c_handler->Init.OwnAddress2 = 0;
            i2c_handler->Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
            i2c_handler->Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

            /* Init the I2C */
            I2Cx_MspInit(i2c_handler);
            HAL_I2C_Init(i2c_handler);
        }
    }

    void HAL_I2C_MspDeInit(I2C_HandleTypeDef* hi2c)
    {
        /* Prevent unused argument(s) compilation warning */
        UNUSED(hi2c);

        /* NOTE : This function should not be modified, when the callback is needed,
                  the HAL_I2C_MspDeInit could be implemented in the user file
         */
    }

    HAL_StatusTypeDef HAL_I2C_DeInit(I2C_HandleTypeDef* hi2c)
    {
        /* Check the I2C handle allocation */
        if (hi2c == NULL)
        {
            return HAL_ERROR;
        }

        /* Check the parameters */
        assert_param(IS_I2C_ALL_INSTANCE(hi2c->Instance));

