nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
        hi2c->State = HAL_I2C_STATE_BUSY;

        /* Disable the I2C Peripheral Clock */
        __HAL_I2C_DISABLE(hi2c);

////////////////#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
////////////////        if (hi2c->MspDeInitCallback == NULL)
////////////////        {
////////////////            hi2c->MspDeInitCallback = HAL_I2C_MspDeInit; /* Legacy weak MspDeInit  */
////////////////        }
////////////////
////////////////        /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
////////////////        hi2c->MspDeInitCallback(hi2c);
////////////////#else
        /* DeInit the low level hardware: GPIO, CLOCK, NVIC */
        HAL_I2C_MspDeInit(hi2c);
//////////////////#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */

        hi2c->ErrorCode = HAL_I2C_ERROR_NONE;
        hi2c->State = HAL_I2C_STATE_RESET;
        hi2c->PreviousState = I2C_STATE_NONE;
        hi2c->Mode = HAL_I2C_MODE_NONE;

        /* Release Lock */
        __HAL_UNLOCK(hi2c);

        return HAL_OK;
    }

    static void I2Cx_Error(I2C_HandleTypeDef* i2c_handler, uint8_t Addr)
    {
        /* De-initialize the I2C communication bus */
        HAL_I2C_DeInit(i2c_handler);

        /* Re-Initialize the I2C communication bus */
        I2Cx_Init(i2c_handler);

        UNUSED(Addr);
    }

    static HAL_StatusTypeDef I2Cx_WriteMultiple(I2C_HandleTypeDef* i2c_handler, uint8_t Addr, uint16_t Reg, uint16_t MemAddress, uint8_t* Buffer, uint16_t Length)
    {
        HAL_StatusTypeDef status = HAL_OK;

        status = HAL_I2C_Mem_Write(i2c_handler, Addr, (uint16_t)Reg, MemAddress, Buffer, Length, 1000);

        /* Check the communication status */
        if (status != HAL_OK)
        {
            /* Re-Initiaize the I2C Bus */
            I2Cx_Error(i2c_handler, Addr);
        }
        return status;
    }

    void TS_IO_WriteMultiple(uint8_t Addr, uint8_t Reg, uint8_t* Buffer, uint16_t Length)
    {
        I2Cx_WriteMultiple(&hI2cAudioHandler, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT, Buffer, Length);
    }

    void TS_IO_Write(uint8_t Addr, uint8_t Reg, uint8_t Value)
    {
        I2Cx_WriteMultiple(&hI2cAudioHandler, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT, (uint8_t*)&Value, 1);
    }

    uint16_t TS_IO_ReadMultiple(uint8_t Addr, uint8_t Reg, uint8_t* Buffer, uint16_t Length)
    {
        return I2Cx_ReadMultiple(&hI2cAudioHandler, Addr, (uint16_t)Reg, I2C_MEMADD_SIZE_8BIT, Buffer, Length);
    }

    static HAL_StatusTypeDef I2Cx_ReadMultiple(I2C_HandleTypeDef* i2c_handler, uint8_t Addr, uint16_t Reg, uint16_t MemAddress, uint8_t* Buffer, uint16_t Length)
    {
        HAL_StatusTypeDef status = HAL_OK;

        status = HAL_I2C_Mem_Read(i2c_handler, Addr, (uint16_t)Reg, MemAddress, Buffer, Length, 1000);

        /* Check the communication status */
        if (status != HAL_OK)
        {
            /* I2C error occured */
            I2Cx_Error(i2c_handler, Addr);
        }
        return status;
    }

    static HAL_StatusTypeDef I2C_RequestMemoryRead(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint32_t Timeout, uint32_t Tickstart)
    {
        I2C_TransferConfig(hi2c, DevAddress, (uint8_t)MemAddSize, I2C_SOFTEND_MODE, I2C_GENERATE_START_WRITE);

        /* Wait until TXIS flag is set */
        if (I2C_WaitOnTXISFlagUntilTimeout(hi2c, Timeout, Tickstart) != HAL_OK)
        {
            return HAL_ERROR;
        }

        /* If Memory address size is 8Bit */
        if (MemAddSize == I2C_MEMADD_SIZE_8BIT)
        {
            /* Send Memory Address */
            hi2c->Instance->TXDR = I2C_MEM_ADD_LSB(MemAddress);
        }
        /* If Memory address size is 16Bit */
        else
        {
            /* Send MSB of Memory Address */
            hi2c->Instance->TXDR = I2C_MEM_ADD_MSB(MemAddress);

            /* Wait until TXIS flag is set */
            if (I2C_WaitOnTXISFlagUntilTimeout(hi2c, Timeout, Tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Send LSB of Memory Address */
            hi2c->Instance->TXDR = I2C_MEM_ADD_LSB(MemAddress);
        }

        /* Wait until TC flag is set */
        if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TC, RESET, Timeout, Tickstart) != HAL_OK)
        {
            return HAL_ERROR;
        }

        return HAL_OK;
    }

    static void I2C_Flush_TXDR(I2C_HandleTypeDef* hi2c)
    {
        /* If a pending TXIS flag is set */
        /* Write a dummy data in TXDR to clear it */
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXIS) != RESET)
        {
            hi2c->Instance->TXDR = 0x00U;
        }

        /* Flush TX register if not empty */
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_TXE) == RESET)
        {
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_TXE);
        }
    }

    static HAL_StatusTypeDef I2C_IsAcknowledgeFailed(I2C_HandleTypeDef* hi2c, uint32_t Timeout, uint32_t Tickstart)
    {
        if (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) == SET)
        {
            /* Wait until STOP Flag is reset */
            /* AutoEnd should be initiate after AF */
            while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_STOPF) == RESET)
            {
                /* Check for the Timeout */
                if (Timeout != HAL_MAX_DELAY)
                {
                    if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
                    {
                        hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
                        hi2c->State = HAL_I2C_STATE_READY;
                        hi2c->Mode = HAL_I2C_MODE_NONE;

                        /* Process Unlocked */
                        __HAL_UNLOCK(hi2c);

                        return HAL_ERROR;
                    }
                }
            }

            /* Clear NACKF Flag */
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

            /* Clear STOP Flag */
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

            /* Flush TX register */
            I2C_Flush_TXDR(hi2c);

            /* Clear Configuration Register 2 */
            I2C_RESET_CR2(hi2c);

            hi2c->ErrorCode |= HAL_I2C_ERROR_AF;
            hi2c->State = HAL_I2C_STATE_READY;
            hi2c->Mode = HAL_I2C_MODE_NONE;

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            return HAL_ERROR;
        }
        return HAL_OK;
    }

    static HAL_StatusTypeDef I2C_WaitOnSTOPFlagUntilTimeout(I2C_HandleTypeDef* hi2c, uint32_t Timeout, uint32_t Tickstart)
    {
        while (__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_STOPF) == RESET)
        {
            /* Check if a NACK is detected */
            if (I2C_IsAcknowledgeFailed(hi2c, Timeout, Tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

