nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
            /* Check for the Timeout */
            if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U))
            {
                hi2c->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
                hi2c->State = HAL_I2C_STATE_READY;
                hi2c->Mode = HAL_I2C_MODE_NONE;

                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);

                return HAL_ERROR;
            }
        }
        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_I2C_Mem_Read(I2C_HandleTypeDef* hi2c, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t* pData, uint16_t Size, uint32_t Timeout)
    {
        uint32_t tickstart;

        /* Check the parameters */
        assert_param(IS_I2C_MEMADD_SIZE(MemAddSize));

        if (hi2c->State == HAL_I2C_STATE_READY)
        {
            if ((pData == NULL) || (Size == 0U))
            {
                hi2c->ErrorCode = HAL_I2C_ERROR_INVALID_PARAM;
                return  HAL_ERROR;
            }

            /* Process Locked */
            __HAL_LOCK(hi2c);

            /* Init tickstart for timeout management*/
            tickstart = HAL_GetTick();

            if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_BUSY, SET, I2C_TIMEOUT_BUSY, tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            hi2c->State = HAL_I2C_STATE_BUSY_RX;
            hi2c->Mode = HAL_I2C_MODE_MEM;
            hi2c->ErrorCode = HAL_I2C_ERROR_NONE;

            /* Prepare transfer parameters */
            hi2c->pBuffPtr = pData;
            hi2c->XferCount = Size;
            hi2c->XferISR = NULL;

            /* Send Slave Address and Memory Address */
            if (I2C_RequestMemoryRead(hi2c, DevAddress, MemAddress, MemAddSize, Timeout, tickstart) != HAL_OK)
            {
                /* Process Unlocked */
                __HAL_UNLOCK(hi2c);
                return HAL_ERROR;
            }

            /* Send Slave Address */
            /* Set NBYTES to write and reload if hi2c->XferCount > MAX_NBYTE_SIZE and generate RESTART */
            if (hi2c->XferCount > MAX_NBYTE_SIZE)
            {
                hi2c->XferSize = MAX_NBYTE_SIZE;
                I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_RELOAD_MODE, I2C_GENERATE_START_READ);
            }
            else
            {
                hi2c->XferSize = hi2c->XferCount;
                I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_AUTOEND_MODE, I2C_GENERATE_START_READ);
            }

            do
            {
                /* Wait until RXNE flag is set */
                if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_RXNE, RESET, Timeout, tickstart) != HAL_OK)
                {
                    return HAL_ERROR;
                }

                /* Read data from RXDR */
                *hi2c->pBuffPtr = (uint8_t)hi2c->Instance->RXDR;

                /* Increment Buffer pointer */
                hi2c->pBuffPtr++;

                hi2c->XferSize--;
                hi2c->XferCount--;

                if ((hi2c->XferCount != 0U) && (hi2c->XferSize == 0U))
                {
                    /* Wait until TCR flag is set */
                    if (I2C_WaitOnFlagUntilTimeout(hi2c, I2C_FLAG_TCR, RESET, Timeout, tickstart) != HAL_OK)
                    {
                        return HAL_ERROR;
                    }

                    if (hi2c->XferCount > MAX_NBYTE_SIZE)
                    {
                        hi2c->XferSize = MAX_NBYTE_SIZE;
                        I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
                    }
                    else
                    {
                        hi2c->XferSize = hi2c->XferCount;
                        I2C_TransferConfig(hi2c, DevAddress, (uint8_t)hi2c->XferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
                    }
                }
            } while (hi2c->XferCount > 0U);

            /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
            /* Wait until STOPF flag is reset */
            if (I2C_WaitOnSTOPFlagUntilTimeout(hi2c, Timeout, tickstart) != HAL_OK)
            {
                return HAL_ERROR;
            }

            /* Clear STOP Flag */
            __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

            /* Clear Configuration Register 2 */
            I2C_RESET_CR2(hi2c);

            hi2c->State = HAL_I2C_STATE_READY;
            hi2c->Mode = HAL_I2C_MODE_NONE;

            /* Process Unlocked */
            __HAL_UNLOCK(hi2c);

            return HAL_OK;
        }
        else
        {
            return HAL_BUSY;
        }
    }

    void ft6x06_TS_EnableIT(uint16_t DeviceAddr)
    {
        uint8_t regValue = 0;
        regValue = (FT6206_G_MODE_INTERRUPT_TRIGGER & (FT6206_G_MODE_INTERRUPT_MASK >> FT6206_G_MODE_INTERRUPT_SHIFT)) << FT6206_G_MODE_INTERRUPT_SHIFT;

        /* Set interrupt trigger mode in FT6206_GMODE_REG */
        TS_IO_Write(DeviceAddr, FT6206_GMODE_REG, regValue);
    }

    void ft6x06_TS_DisableIT(uint16_t DeviceAddr)
    {
        uint8_t regValue = 0;
        regValue = (FT6206_G_MODE_INTERRUPT_POLLING & (FT6206_G_MODE_INTERRUPT_MASK >> FT6206_G_MODE_INTERRUPT_SHIFT)) << FT6206_G_MODE_INTERRUPT_SHIFT;

        /* Set interrupt polling mode in FT6206_GMODE_REG */
        TS_IO_Write(DeviceAddr, FT6206_GMODE_REG, regValue);
        UNUSED(DeviceAddr);
    }

    uint8_t ft6x06_TS_ITStatus(uint16_t DeviceAddr)
    {
        /* Always return 0 as feature not applicable to FT6206 */
        UNUSED(DeviceAddr);
        return 0;
    }

    void ft6x06_TS_ClearIT(uint16_t DeviceAddr)
    {
        UNUSED(DeviceAddr);
        /* Nothing to be done here for FT6206 */
    }

    static void DSI_ConfigPacketHeader(DSI_TypeDef* DSIx,
        uint32_t ChannelID,
        uint32_t DataType,
        uint32_t Data0,
        uint32_t Data1)
    {
        /* Update the DSI packet header with new information */
        DSIx->GHCR = (DataType | (ChannelID << 6U) | (Data0 << 8U) | (Data1 << 16U));
    }
    static HAL_StatusTypeDef HAL_DSI_ShortWrite(DSI_HandleTypeDef* hdsi,
        uint32_t ChannelID,
        uint32_t Mode,
        uint32_t Param1,
        uint32_t Param2)
    {
        uint32_t tickstart;

        /* Get tick */
        tickstart = HAL_GetTick();

        /* Wait for Command FIFO Empty */
        while ((hdsi->Instance->GPSR & DSI_GPSR_CMDFE) == 0U)
        {
            /* Check for the Timeout */
            if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
            {
                return HAL_TIMEOUT;
            }
        }

        /* Configure the packet to send a short DCS command with 0 or 1 parameter */
        /* Update the DSI packet header with new information */
        hdsi->Instance->GHCR = (Mode | (ChannelID << 6U) | (Param1 << 8U) | (Param2 << 16U));

        return HAL_OK;
    }

    HAL_StatusTypeDef HAL_DSI_LongWrite(DSI_HandleTypeDef* hdsi,
        uint32_t ChannelID,
        uint32_t Mode,
        uint32_t NbParams,
        uint32_t Param1,
        uint8_t* ParametersTable)
    {
        uint32_t uicounter, nbBytes, count;
        uint32_t tickstart;
        uint32_t fifoword;
        uint8_t* pparams = ParametersTable;

        /* Process locked */
        __HAL_LOCK(hdsi);

        /* Check the parameters */
        assert_param(IS_DSI_LONG_WRITE_PACKET_TYPE(Mode));

        /* Get tick */
        tickstart = HAL_GetTick();

        /* Wait for Command FIFO Empty */
        while ((hdsi->Instance->GPSR & DSI_GPSR_CMDFE) == 0U)
        {
            /* Check for the Timeout */
            if ((HAL_GetTick() - tickstart) > DSI_TIMEOUT_VALUE)
            {
                /* Process Unlocked */
                __HAL_UNLOCK(hdsi);

