nanoframework/nf-interpreter/targets/CMSIS-OS/ChibiOS/ST_STM32F769I_DISCOVERY/nanoCLR/nanoFramework.Graphics/STM32F7LcdSupport.c
                return HAL_TIMEOUT;
            }
        }

        /* Set the DCS code on payload byte 1, and the other parameters on the write FIFO command*/
        fifoword = Param1;
        nbBytes = (NbParams < 3U) ? NbParams : 3U;

        for (count = 0U; count < nbBytes; count++)
        {
            fifoword |= (((uint32_t)(*(pparams + count))) << (8U + (8U * count)));
        }
        hdsi->Instance->GPDR = fifoword;

        uicounter = NbParams - nbBytes;
        pparams += nbBytes;
        /* Set the Next parameters on the write FIFO command*/
        while (uicounter != 0U)
        {
            nbBytes = (uicounter < 4U) ? uicounter : 4U;
            fifoword = 0U;
            for (count = 0U; count < nbBytes; count++)
            {
                fifoword |= (((uint32_t)(*(pparams + count))) << (8U * count));
            }
            hdsi->Instance->GPDR = fifoword;

            uicounter -= nbBytes;
            pparams += nbBytes;
        }

        /* Configure the packet to send a long DCS command */
        DSI_ConfigPacketHeader(hdsi->Instance,
            ChannelID,
            Mode,
            ((NbParams + 1U) & 0x00FFU),
            (((NbParams + 1U) & 0xFF00U) >> 8U));

        /* Process unlocked */
        __HAL_UNLOCK(hdsi);

        return HAL_OK;
    }

    void DSI_IO_WriteCmd(uint32_t NbrParams, uint8_t* pParams)
    {
        if (NbrParams <= 1)
        {
            HAL_DSI_ShortWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
        }
        else
        {
            HAL_DSI_LongWrite(&hdsi_discovery, LCD_OTM8009A_ID, DSI_DCS_LONG_PKT_WRITE, NbrParams, pParams[NbrParams], pParams);
        }
    }
